{"id":"25JnLB7bCaiYJ","title":"Tech News","displayTitle":"Tech News","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":91,"items":[{"title":"After nine years of grinding, Replit finally found its market. Can it keep it?","url":"https://techcrunch.com/2025/10/02/after-nine-years-of-grinding-replit-finally-found-its-market-can-it-keep-it/","date":1759467496,"author":"Connie Loizos","guid":205,"unread":true,"content":"<article>While AI coding startups like Cursor raise brow-raising rounds on barely three years of existence, Replit's path to a $3 billion valuation has been anything but swift.</article>","contentLength":167,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Thermal Daemon 2.5.10 Released With A Few Improvements","url":"https://www.phoronix.com/news/Intel-Thermal-Daemon-2.5.10","date":1759464000,"author":"Michael Larabel","guid":732,"unread":true,"content":"<article>As the first update to the Intel Thermal Daemon since February when v2.5.9 brought Panther Lake support, Intel Thermal Daemon 2.5.10 was tagged on Thursday...</article>","contentLength":158,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cops: Accused Vandal Confessed To ChatGPT","url":"https://yro.slashdot.org/story/25/10/02/238239/cops-accused-vandal-confessed-to-chatgpt?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759462200,"author":"BeauHD","guid":281,"unread":true,"content":"alternative_right shares a report from the Smoking Gun: Minutes after vandalizing 17 cars in a Missouri college parking lot, a 19-year-old sophomore had a lengthy ChatGPT conversation during which he confessed to the crime, asked about the possibility of getting caught, and wondered, \"is there any way they could know it was me,\" according to a police probable cause statement. Ryan Schaefer was arrested yesterday and charged with felony property damage for a rampage early Sunday at a Missouri State University parking lot. Investigators allege that Schaefer shattered car windows, ripped off side mirrors, dented hoods, and broke windshield wipers during the 3 AM spree.\n \nWhen confronted with surveillance footage and other evidence, Schaefer said that he could see the resemblance between the suspect and himself. At that point, Schaefer reportedly consented to a search of his iPhone. A subsequent review of the device revealed location data placing Schaefer \"at or near the scene of the crime,\" as well as a \"troubling dialogue exchange this defendant seems to have had with artificial intelligence software installed on his phone,\" prosecutors reported. The incriminating ChatGPT conversation can be found here.","contentLength":1220,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Autism Should Not Be Seen As Single Condition With One Cause, Say Scientists","url":"https://science.slashdot.org/story/25/10/02/2217211/autism-should-not-be-seen-as-single-condition-with-one-cause-say-scientists?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759456920,"author":"BeauHD","guid":280,"unread":true,"content":"Bruce66423 shares a report from The Guardian: Those diagnosed as small children typically have distinct genetic profile from those diagnosed later, [finds an international study based on genetic data from more than 45,000 autistic people in Europe and the U.S]. So, there's more than one condition out there that's being diagnosed as \"autism.\" This, of course, messes with the debate about causes; one version of autism may be caused by something for which the evidence is very weak overall. \"The term 'autism' likely describes multiple conditions,\" said Dr Varun Warrier, from Cambridge's department of psychiatry, senior author of the research. \"For the first time, we have found that earlier and later diagnosed autism have different underlying biological and developmental profiles.\"\n \n\"It is a gradient,\" added Warrier. \"There are also many other factors that contribute to age of diagnosis, so the moment you go from averages to anything that is applicable to an individual, it's false equivalency.\"\n \nThe analysis has been published in the journal Nature.","contentLength":1062,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ford IT Systems Tampered With To Display Vulgar Anti-RTO Message Across Office Screens","url":"https://it.slashdot.org/story/25/10/02/224238/ford-it-systems-tampered-with-to-display-vulgar-anti-rto-message-across-office-screens?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759454700,"author":"BeauHD","guid":279,"unread":true,"content":"Ford's push for a four-day in-office workweek hit turbulence when someone hijacked meeting room screens to display an anti-RTO protest image targeting CEO Jim Farley. The company quickly removed it and is investigating. The Detroit Free Press reports: According to photos employees took of the image, which were posted on social media and sent to the Detroit Free Press, it contained an image of CEO Jim Farley along with a big red circle with a slash through it over his face and the words \"(Expletive) RTO.\"\n \n\"We're aware of an inappropriate use of Ford's IT technology and we're investigating it,\" Dave Tovar, Ford spokesman, told the Detroit Free Press. Tovar said the image was up for \"a short amount of time\" and Ford was able to quickly remove it. He said the company is investigating whether the image appeared only in Dearborn offices or globally.\n \nFarley mandated that employees return to the office four days a week earlier this year and it has been in place since Sept. 1, with no fallout such as people quitting over it, Tovar said. Therefore, Tovar said, \"I wouldn't be able to speculate on it, as to why someone would do this.\"","contentLength":1144,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Colorado Deploys Self-Driving Crash Trucks To Protect Highway Workers","url":"https://tech.slashdot.org/story/25/10/02/2156215/colorado-deploys-self-driving-crash-trucks-to-protect-highway-workers?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759452300,"author":"BeauHD","guid":278,"unread":true,"content":"Colorado unveiled an autonomous crash-protection truck designed to absorb highway work zone collisions, removing human drivers from one of the most dangerous road maintenance roles. The Denver Gazette reports: At a press event in Falcon on Monday, the Colorado Department of Transportation demonstrated an autonomous truck-mounted attenuator -- a driverless crash-protection vehicle designed to absorb impacts in roadside work areas. These trucks are already in the state's fleet, but previously required a worker in the cab, leaving them exposed during crashes. \"These vehicles are designed to get hit so people don't have to,\" said Kay Kelly, CDOT's chief of innovative mobility. \"We want to remove the human from that truck whenever possible.\"\n \n[...] Colorado pioneered this technology in 2017, becoming the first state to test it. Developed by San Diego-based defense contractor Kratos Defense, the company started on autonomous follower systems in 2012 and installed its initial version in Colorado in 2013, according to Maynard Factor, Kratos' vice president of business development. The system uses sensors, actuators, and video links, allowing the unmanned crash truck to trail directly behind a paint-striping or maintenance vehicle. The lead vehicle records its route and transmits navigation data to the follower. Both are equipped with global positioning system and communication tools, with the lead driver monitoring via video feed.\n \n\"It's a convoy system,\" Factor said. \"The leader does the work, while the driverless vehicle mirrors its path. This protects the operator with the crash truck instead of sitting inside it.\" Sensors detect objects darting into the lane, triggering an automatic stop. Operators can pause or override via a user interface featuring forward-facing cameras on the autonomous truck and rear-facing ones on the work vehicle. The trucks, existing state assets, are driven to sites and then switched to autonomous mode. Outfitting each with the technology costs about $1 million, excluding the base vehicle and crash absorber.","contentLength":2067,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sheaves Merged For Linux 6.18 - Can Help With Better Performance","url":"https://www.phoronix.com/news/Linux-6.18-Slab-Sheaves","date":1759450740,"author":"Michael Larabel","guid":731,"unread":true,"content":"<article>The Slab pull request was merged this evening for the ongoing Linux 6.18 merge window. Most notable with the Slab updates is the introduction of Sheaves...</article>","contentLength":155,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"New Zealand's Institute of IT Professionals Collapses","url":"https://it.slashdot.org/story/25/10/02/2116200/new-zealands-institute-of-it-professionals-collapses?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759449720,"author":"BeauHD","guid":277,"unread":true,"content":"An anonymous reader quotes a report from The Register: New Zealand's Institute of IT Professionals has discovered it is insolvent and advised members it has no alternative but to enter liquidation. The Institute (ITP) wrote to members on Thursday and posted a document titled \"Important Update on ITP's Future\" that reveals it has \"reached a point where the organization cannot continue. After a full review of our finances, the Board has confirmed that ITP is insolvent.\"\n \nInsolvency seems to have come as something of a surprise. \"These debts are historic. They go back over many years. While some of the issues were worked on in more recent times, the full scale of the problem only became visible during the leadership change in 2025,\" the Update states. \"Once the Board understood the full picture, it was clear that there was no responsible way forward other than liquidation.\" [...]\n \nITP's constitution requires its members to formally resolve to wind up the organization, so as one of its final acts the group has called a Special General Meeting (SGM) for 23 October 2025 to confirm liquidation and appoint a liquidator. This situation impacts more than ITP's ~10,000 members, because the organization offers assessment services that assess whether IT professionals' skills and qualifications make them eligible to move to New Zealand for work. ITP also certifies IT degrees at New Zealand universities, and oversees the NZ Cloud Computing Code of Practice. ITP also conducted educational and advocacy activities aimed at growing New Zealand's tech workforce.","contentLength":1570,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Amazon to resume drone delivery following crash in Arizona","url":"https://techcrunch.com/2025/10/02/amazon-to-resume-drone-delivery-following-crash-in-arizona/","date":1759447823,"author":"Kirsten Korosec","guid":204,"unread":true,"content":"<article>Investigations by the National Transportation Safety Board and Federal Aviation Administration are underway. </article>","contentLength":109,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AMD In Early Talks To Make Chips At Intel Foundry","url":"https://hardware.slashdot.org/story/25/10/02/210246/amd-in-early-talks-to-make-chips-at-intel-foundry?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759447200,"author":"BeauHD","guid":276,"unread":true,"content":"\"Your AMD chips may have Intel Inside soon,\" writes longtime Slashdot reader DesScorp. \"Discussions are underway between the two companies to move an undisclosed amount of AMD's chip business to Intel foundries. (AMD currently does their production through TSMC.) The talks come hot on the heels of a flurry of other Intel investments.\" Tom's Hardware reports: In the past several weeks, Intel has seen a flurry of activity and investments. The United States announced a 9.9% ownership stake in Intel, while Softbank bought $2 billion worth of shares. Alongside Nvidia, Intel announced new x86 chips using Nvidia graphics technology, with the graphics giant also purchasing $5 billion in Intel shares. There have also been reports that Intel and Apple have been exploring ways to work together. The article notes that there is a trade/political dimension to an AMD-Intel deal as well: It makes sense for Intel's former rivals -- especially American companies -- to consider coming to the table. The White House is pushing for 50% of chips bound for America to be built domestically, and tariffs on chips aren't off the table. Additionally, doing business with Intel could make the US government, Intel's largest shareholder, happy, which can be good for business. AMD faced export restrictions on its GPUs earlier this year as the US attempted to throttle China's AI business.","contentLength":1376,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Two Amazon Delivery Drones Crash Into Crane In Arizona","url":"https://tech.slashdot.org/story/25/10/02/2054222/two-amazon-delivery-drones-crash-into-crane-in-arizona?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759444800,"author":"BeauHD","guid":275,"unread":true,"content":"Two Amazon Prime Air drones collided with a crane in Tolleson, Arizona near 96th Avenue and Roosevelt Street. Amazon confirmed the incident and is working with authorities to determine what happened, though no injuries have been reported. CNBC reports: The incident occurred on Wednesday around 1 p.m. EST in Tolleson, Arizona, a city west of Phoenix. Two MK30 drones crashed into the boom of a stationary construction crane that was in a commercial area just a few miles away from an Amazon warehouse. One person was evaluated on the scene for possible smoke inhalation, said Sergeant Erik Mendez of the Tolleson Police Department.\n \nBoth drones sustained \"substantial\" damage from the collision on Wednesday, which occurred when the aircraft were mid-route, according to preliminary FAA crash reports. The Federal Aviation Administration and National Transportation Safety Board are investigating the incident. The drones were believed to be flying northeast back-to-back when they collided with the crane that was being used for roof work on a distribution facility, Tolleson police said in a release. The drones landed in the backyard of a nearby building, according to the release.","contentLength":1186,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sports Piracy Operator Goes From Jail To Getting Hired By a Tech Unicorn In a Month","url":"https://yro.slashdot.org/story/25/10/02/2036202/sports-piracy-operator-goes-from-jail-to-getting-hired-by-a-tech-unicorn-in-a-month?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759442400,"author":"BeauHD","guid":274,"unread":true,"content":"An anonymous reader quotes a report from TorrentFreak: The operator of a popular pirate sports streaming site in Argentina has gone from spending time in jail with murderers to landing a new high-profile job a month later. Alejo \"Shishi\" Warles, the 25-year-old operator of Al Angulo TV, was arrested on August 20 in a LaLiga-backed crackdown. After his release on bail, he was hired by professional esports team 9z Globant, a partnership involving Argentine tech unicorn Globant. [...] The team is the result of a partnership between 9z Team and Argentinian tech unicorn Globant. Somewhat ironically, Globant previously worked with LaLiga to monitor the live-streaming user experience. Warles welcomed himself to 9z Globant via the team's social media account, referring to himself as an idol, genius, and GOAT.\n \nLucia Quinteros, the main social media manager at the esports team, informed Entre Rios that after considering their new hire's history, they believe that he can add value to the team. \"We hired Alejo, not the person who set up that project (Al Angulo TV). Of course, we evaluated what happened, but we believe that, from now on, Alejo can pursue a different career path,\" Quinteros said. According to Warles himself, he was hired because he's the best. Like many of his comments, this bravado should not be taken too seriously, but nevertheless sits in stark contrast to the typical pirate site operator facing criminal charges.","contentLength":1444,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Privacy for Subdomains: Here's What You Should Be Focusing On","url":"https://hackernoon.com/privacy-for-subdomains-heres-what-you-should-be-focusing-on?source=rss","date":1759442297,"author":"Nicolas Fränkel","guid":323,"unread":true,"content":"<p>Last week, I described a <a href=\"https://blog.frankel.ch/privacy-subdomains/1/\">gloomy situation</a>: all public TLS certificate providers log your requests. By browsing through the subdomains, one can get their respective IP addresses. If one of them points to your home route, they know your general location.</p><p>\\\nI analyzed several solutions and decided to use wildcard certificates, which don't leak subdomain information, while continuing to use Let's Encrypt. My solution caters to my <a href=\"https://www.synology.com\">Synology</a> NAS, as it's the one I'm using.</p><h2>Getting a Wildcard Certificate for Synology NAS</h2><p>The Synology UI allows configuring Let's Encrypt for automated certificate renewal. But you can get wildcard certificates only for Synology subdomains:</p><blockquote><p>Only domains of Synology DDNS support wildcard certificates issued by Let's Encrypt.</p></blockquote><p>\\\nIt's time to become creative. The most widespread Let's Encrypt client is Certbot, but a surface search reveals it doesn't run on Synology. Underneath, Let's Encrypt delivers certificates via the <a href=\"https://en.wikipedia.org/wiki/Automatic_Certificate_Management_Environment\">Automatic Certificate Management Environment</a> protocol. Lots of <a href=\"https://letsencrypt.org/docs/client-options/\">clients</a> already implement the Automatic Certificate Management Environment (ACME) protocol. <a href=\"http://acme.sh\">acme.sh</a> looked like an interesting candidate:</p><blockquote><ul><li>An ACME protocol client written purely in Shell (Unix shell) language.</li><li>Full ACME protocol implementation.</li><li>Support SAN and wildcard certs</li><li>Simple, powerful and very easy to use. You only need 3 minutes to learn it.</li><li>Bash, dash and sh compatible.</li><li>Purely written in Shell with no dependencies on python.</li><li>Just one script to issue, renew and install your certificates automatically.</li><li>DOES NOT require  access.</li><li>Cron job notifications for renewal or error etc.</li></ul></blockquote><p>\\\nIcing on the cake, <a href=\"http://acme.sh\">acme.sh</a> provides a Docker image. At the same time, Synology offers a Docker runtime. I thus decided to implement certificate renewal with the <a href=\"http://acme.sh\">acme.sh</a> Docker image. Here's how I proceeded.</p><p>\\\nGo to the  menu. In the opening window, click on , then . It opens a Create Container window. Click on  and search for .</p><p>\\\nWe will need to create two containers out of it: one for requesting a new certificate, and one for managing the update of the certificate on the NAS.</p><p>Before we go further, we need:</p><ul><li><p>To get a token with permissions to edit the DNS records:</p><p>In my case, it's Cloudflare. You can check the process for other providers on the <a href=\"https://github.com/acmesh-official/acme.sh/wiki/dnsapi\">acme.sh wiki</a>.</p><p>\\\nGo to the <a href=\"https://dash.cloudflare.com/profile/api-tokens\">Cloudflare UI</a>. Create an API token with the template to . Set a relevant name. Then, set the Zone Resources to the following:</p><p>| Include | Specific zone |  |</p><p>\\\nWrite down the token value in a secure place, as you won't be able to access it later!</p></li><li><p>Prepare an account for the Synology:</p><p>For security purposes, we want to run the containers with a dedicated account.</p><p>\\\nCheck the section Create a user in Synology DSM in <a href=\"https://dr-b.io/post/Synology-DSM-7-with-Lets-Encrypt-and-DNS-Challenge\">this post</a> and follow its instructions. It's what I did, and it worked exactly as described.</p></li></ul><h3>Requesting the Certificate</h3><p>Go back to the Synology UI, more specifically, the  menu. Click on the  button. It opens a wizard with several screens:</p><p>When you run the container, it will create the required files in the  folder.</p><pre><code>ls -ltr /volume2/homes/certadmin\n</code></pre><pre><code>total 8\ndrwxrwxrwx+ 1 root root 210 Jun 26 07:58 '*.frankel.ch_ecc'\ndrwxrwxrwx+ 1 root root  56 Jun 26 08:38  ca\n-rwxrwxrwx+ 1 root root 494 Jul  5 14:30  http.header\n-rwxrwxrwx+ 1 root root 154 Jul  5 14:30  account.conf\n</code></pre><p>\\\nIf it doesn't work, you can access the logs by selecting the image and clicking on the  button. The log tab shows the logs, broken up by day. Here's a log sample of a successful run:</p><pre><code>[Sat Jul  5 12:30:17 UTC 2025] Verification finished, beginning signing.\"\n[Sat Jul  5 12:30:17 UTC 2025] Let's finalize the order.\n[Sat Jul  5 12:30:17 UTC 2025] Le_OrderFinalize='https://acme-v02.api.letsencrypt.org/acme/finalize/2489606761/402920873611'\n[Sat Jul  5 12:30:19 UTC 2025] Downloading cert.\n[Sat Jul  5 12:30:19 UTC 2025] Le_LinkCert='https://acme-v02.api.letsencrypt.org/acme/cert/05a220cfe82f0e3576f8230d7f62a58dd28b'\n[Sat Jul  5 12:30:19 UTC 2025] Cert success.\n-----BEGIN CERTIFICATE-----\n  REDACTED\n  REDACTED\n  REDACTED\n  REDACTED\n  REDACTED\n  REDACTED\n-----END CERTIFICATE-----\n[Sat Jul  5 12:30:19 UTC 2025] Your cert is in: /acme.sh/*.frankel.ch_ecc/*.frankel.ch.cer\n[Sat Jul  5 12:30:19 UTC 2025] Your cert key is in: /acme.sh/*.frankel.ch_ecc/*.frankel.ch.key\n[Sat Jul  5 12:30:20 UTC 2025] The intermediate CA cert is in: /acme.sh/*.frankel.ch_ecc/ca.cer\n[Sat Jul  5 12:30:20 UTC 2025] And the full-chain cert is in: /acme.sh/*.frankel.ch_ecc/fullchain.cer\n</code></pre><h3>Deploying the Certificate</h3><p>We will use the same image to deploy the certificate, albeit with a different configuration.</p><p>The image uses the files created by the previous image to update the TLS certificate used by the Synology web app.</p><h3>Scheduling the Run of the Images</h3><p>In an ideal world, you'd run the first image, and a successful run would trigger the run of the second image. Unfortunately, Synology doesn't lend itself to this, or to be precise, I didn't find a way to achieve it. Instead, I relied on a simple workaround: schedule the second image run one day after the first image run.</p><p>\\\nIn the Synology UI, open the Control Panel and search for the Task Scheduler. Click on the  button. Select <em>Scheduled Task &gt; User-defined script</em>, as there's no dedicated Docker run item.</p><p>\\\nHere's how to configure it:</p><p>The script uses the  command. I stumbled upon the command; parameters are self-explanatory, but I didn't find the documentation. You need to create two scheduled tasks and change the task name as well as the image name in the command.</p><p>\\\nFor scheduling, space out one day between getting a new certificate and deploying it. That should give enough time and doesn't change the result.</p><p>\\\nNote that because images run to completion, , they don't loop, Synology will send a warning notification similar to the following, regardless of whether the run was successful or not:</p><blockquote><p>Docker container neilpang-acme-deploy-cert stopped unexpectedly. Go to Docker for more information.</p></blockquote><p>\\\nAfter running the two Docker images in turn, your NAS will be using a joker certificate.</p><p>In this post, we implemented a solution to avoid leaking subdomain information when requesting a TLS certificate: requesting wildcard certificates with <a href=\"http://acme.sh\">acme.sh</a> from Synology. The solution isn't perfect: you can use wildcard certificates on any subdomains, but it represents a security risk if someone steals them. </p><p>\\\nBesides, I stored the secrets as environment variables for configuring Docker images. However, in my context, these are acceptable risks.</p><p>\\\nNote that this approach doesn't remove any previously logged requests. The only workaround is to move to another place, or, barring that, change your Internet Service Provider.</p><p><em>Originally published at <a href=\"https://blog.frankel.ch/privacy-subdomains/2/\">A Java Geek</a> on September 28th, 2025</em></p>","contentLength":6656,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What’s Wrong with AWS Lambda at the Edge?","url":"https://hackernoon.com/whats-wrong-with-aws-lambda-at-the-edge?source=rss","date":1759441503,"author":"EScholar: Electronic Academic Papers for Scholars","guid":322,"unread":true,"content":"<p><strong>Current Frameworks for FaaS</strong>: Existing cloud-based FaaS implementations, such as AWS Lambda [8] or OpenFaaS [32], underutilize computing resources on the edge of the network. Attempts to deploy such frameworks to the edge, such as Akamai [4], do not deliver the security guarantee required by the Edge Computing. S-FaaS [5], Clemmys [42] uses TEE and cryptographic attestation to protect the confidentiality of the execution. For all the aforementioned FaaS frameworks, they do not support stateful FaaS execution [38].</p><p>\\\n<strong>Secure Execution with TEE</strong>: PSL is motivated by the vision that the distributive worker can run securely in a TEE on a single host, making the security and efficiency of communication among multiple enclaves a logical research problem. This vision is supported by a variety of available container services and platforms, for example, TEE-enabled container services such as GrapheneSGX [43], Scone [7], and Occlum [34] and hardware TEE platforms [27] , Elasticlave [46] and Penglai [16]. Snort [26] is an in-enclave intrusion detection framework that also uses a circular buffer for communication. We note our approach differs from Snort in that they use circular buffers to convert hugepages in DPDK, while our circular buffer design is to eliminate the context switch in ecalls/ocalls.</p><p>\\\n: Existing TEE-based KVS designs mainly focus on single-TEE persistence and performance optimizations. ShieldStore [25] solves the 128MB limitation of SGXv1 by conducting most processing outside the enclave. Each key-value pair is encrypted and protected with a signature when it leaves the enclave, and the main data structures of the KVS are also stored outside the enclave. The in-enclave KVS server handles queries from an out-of-enclave client by fetching encrypted key-value pairs from untrusted memory. Speicher [9] and DiskShield [3] implement secure storage inside a secure enclave, so that the TEE can exchange data securely to the underlying storage of the host. Both SCL and Speicher [9] use a LSM-based structure for durablity, but SCL takes a step further to integrate the stored data blocks as part of the DataCapsule hash chain, and to enable efficient interenclave communication. SCL also has a much smaller TCB required than Speicher. EnclaveCache [10] and Omega [14] supports shared, in-memory KVS cache but does not support communication of enclaves from different hosts.</p><p>We introduced Paranoid Stateful Lambdas, a federated FaaS framework for secure and stateful execution in both cloud and edge computing environments. We focus on the security and communication aspects of PSL by exploiting the properties and extensions of DataCaspules, a cryptographically-hardened blockchain. We propose an abstraction, the Secure Concurrency Layer, that provides security and eventual consistency to the enclaves, as well as discuss its durability and fault tolerance semantics. On our end-to-end benchmark, SCL has up to 81x higher throughput and 2.08x lower latency than the unoptimized baseline. Our system throughput scales linearly with the number of the lambdas, and our lambda task can be dispatched to authenticated workers within 0.61 second.</p><p>We thank Anoop Jaishankar for great discussion on Asylo attestation. This material is based upon work supported by NSF/VMware Partnership on Edge Computing Data Infrastructure (ECDI), NSF award 1838833. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the authors and do not necessarily reflect the views of the sponsors.</p><p>[1] Cloc. http://cloc.sourceforge.net/. Accessed: 2021-05-1.</p><p>\\\n[2] Olzhas Adiyatov and Atakan Varol. Rapidly-exploring random tree based memory efficient motion planning. pages 354–359, 08 2013.</p><p>\\\n[3] Jinwoo Ahn, Junghee Lee, Yungwoo Ko, Donghyun Min, Jiyun Park, Sungyong Park, and Youngjae Kim. Diskshield: A data tamper-resistant storage for intel sgx. In Proceedings of the 15th ACM Asia Conference on Computer and Communications Security, pages 799–812, 2020.</p><p>\\\n[4] Akamai. Akamai serverless edge. https: //www.akamai.com/us/en/products/performance/ serverless-computing-edgeworkers.jsp.</p><p>\\\n[5] Fritz Alder, N Asokan, Arseny Kurnikov, Andrew Paverd, and Michael Steiner. S-faas: Trustworthy and accountable function-as-a-service using intel sgx. In Proceedings of the 2019 ACM SIGSAC Conference on Cloud Computing Security Workshop, pages 185–199, 2019.</p><p>\\\n[6] Andreas M. Antonopoulos. Mastering Bitcoin. O’Reilly Media, 2017.</p><p>\\\n[7] Sergei Arnautov, Bohdan Trach, Franz Gregor, Thomas Knauth, Andre Martin, Christian Priebe, Joshua Lind, Divya Muthukumaran, Dan O’Keeffe, Mark Stillwell, et al. SCONE: Secure Linux Containers with Intel SGX. In 12th USENIX Symposium on Operating Systems Design and Implementation (OSDI 16), volume 16, pages 689–703. USENIX Association, November 2016.</p><p>\\\n[8] AWS. AWS Lambda. https://aws.amazon.com/lambda/, note = Accessed: 2021-05-1.</p><p>\\\n[9] Maurice Bailleu, Jorg Thalheim, Pramod Bhatotia, ¨ Christof Fetzer, Michio Honda, and Kapil Vaswani. Speicher: Securing lsm-based key-value stores using shielded execution. In 17th USENIX Conference on File and Storage Technologies (FAST 19), pages 173–190, 2019.</p><p>\\\n[10] Lixia Chen, Jian Li, Ruhui Ma, Haibing Guan, and HansArno Jacobsen. Enclavecache: A secure and scalable key-value cache in multi-tenant clouds using intel sgx. In Proceedings of the 20th International Middleware Conference, Middleware ’19, page 14–27, New York, NY, USA, 2019. Association for Computing Machinery.</p><p>\\\n[11] Sanchuan Chen, Xiaokuan Zhang, Michael K. Reiter, and Yinqian Zhang. Detecting privileged side-channel attacks in shielded execution with dej´ a vu. In ` Proceedings of the 2017 ACM on Asia Conference on Computer and Communications Security, ASIA CCS ’17, page 7–18, New York, NY, USA, 2017. Association for Computing Machinery.</p><p>\\\n[12] Alexander Conway, Abhishek Gupta, Vijay Chidambaram, Martin Farach-Colton, Richard Spillane, Amy Tai, and Rob Johnson. Splinterdb: Closing the bandwidth gap for nvme key-value stores. In 2020 {USENIX} Annual Technical Conference ({USENIX}{ATC} 20), pages 49–63, 2020.</p><p>\\\n[13] Intel Corporation. Intel(r) software guard extensions sdk for linux* os. https://download.01.org/intel-sgx/linux-1. 8/docs/Intel SGX SDK Developer Reference Linux 1.8 Open Source.pdf, 2017.</p><p>\\\n[14] Claudio Correia, Miguel Correia, and Luıs Rodrigues. Omega: a secure event ordering service for the edge. In 2020 50th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), pages 489– 501. IEEE, 2020.</p><p>\\\n[15] Victor Costan and Srinivas Devadas. Intel sgx explained. IACR Cryptol. ePrint Arch., 2016(86):1–118, 2016.</p><p>\\\n[16] Erhu Feng, Xu Lu, Dong Du, Bicheng Yang, Xueqiang Jiang, Yubin Xia, Binyu Zang, and Haibo Chen. Scalable memory protection in the penglai enclave. 2021.</p><p>\\\n[17] Fetch Robotics. Fetch research robot. http://fetchrobotics. com/research/.</p><p>\\\n[18] Sadjad Fouladi, Riad S Wahby, Brennan Shacklett, Karthikeyan Vasuki Balasubramaniam, William Zeng, Rahul Bhalerao, Anirudh Sivaraman, George Porter, and Keith Winstein. Encoding, fast and slow: Low-latency video processing using thousands of tiny threads. In 14th USENIX Symposium on Networked Systems Design and Implementation (NSDI 17), pages 363–376, 2017.</p><p>\\\n[19] Pedro Garcia Lopez, Alberto Montresor, Dick Epema, Anwitaman Datta, Teruo Higashino, Adriana Iamnitchi, Marinho Barcellos, Pascal Felber, and Etienne Riviere. Edge-centric computing: Vision and challenges. ACM SIGCOMM Computer Communication Review, 45(5):37– 42, 2015.</p><p>\\\n[20] Kourosh Gharachorloo, Daniel Lenoski, James Laudon, Phillip Gibbons, Anoop Gupta, and John Hennessy. Memory Consistency and Event Ordering in Scalable Shared-Memory Multiprocessors. In ISCA. ACM, 1990.</p><p>\\\n[21] Google. Asylo. https://asylo.dev/. Accessed: 2021-05-1.</p><p>\\\n[22] Google. Asylo socket. https://asylo.dev/docs/reference/ runtime.html. Accessed: 2021-05-1.</p><p>\\\n[23] Jeffrey Ichnowski, William Lee, Victor Murta, Samuel Paradis, Ron Alterovitz, Joseph E Gonzalez, Ion Stoica, and Ken Goldberg. Fog Robotics Algorithms for Distributed Motion Planning Using Lambda Serverless Computing. In 2020 IEEE International Conference on Robotics and Automation (ICRA), pages 4232–4238, 2020.</p><p>\\\n[24] Sertac Karaman and Emilio Frazzoli. Sampling-based algorithms for optimal motion planning, 2011.</p><p>\\\n[25] Taehoon Kim, Joongun Park, Jaewook Woo, Seungheun Jeon, and Jaehyuk Huh. Shieldstore: Shielded in-memory key-value storage with sgx. In Proceedings of the Fourteenth EuroSys Conference 2019, EuroSys ’19, New York, NY, USA, 2019. Association for Computing Machinery.</p><p>\\\n[26] Dmitrii Kuvaiskii, Somnath Chakrabarti, and Mona Vij. Snort intrusion detection system with intel software guard extension (intel sgx). arXiv preprint arXiv:1802.00508, 2018.</p><p>\\\n[27] Dayeol Lee, David Kohlbrenner, Shweta Shinde, Dawn Song, and Krste Asanovic. Keystone: An open ´ framework for architecting tees. arXiv preprint arXiv:1907.10119, 2019.</p><p>\\\n[28] Microsoft. Openenclave switchless. https: //github.com/openenclave/openenclave/tree/master/ samples/switchless. Accessed: 2021-05-1.</p><p>\\\n[29] Nitesh Mor, Richard Pratt, Eric Allman, Kenneth Lutz, and John Kubiatowicz. Global data plane: A federated vision for secure data in edge computing. In 2019 IEEE 39th International Conference on Distributed Computing Systems (ICDCS), pages 1652–1663. IEEE, 2019.</p><p>\\\n[30] Satoshi Nakamoto. Bitcoin: A peer-to-peer electronic cash system. Technical report, Manubot, 2019.</p><p>\\\n[31] Oleksii Oleksenko, Bohdan Trach, Robert Krahn, Mark Silberstein, and Christof Fetzer. Varys: Protecting SGX enclaves from practical side-channel attacks. In 2018 USENIX Annual Technical Conference (USENIX ATC 18), pages 227–240, Boston, MA, July 2018. USENIX Association.</p><p>\\\n[32] OpenFaaS. Openfaas. https://www.openfaas.com/.</p><p>\\\n[33] Vaishaal Shankar, Karl Krauth, Qifan Pu, Eric Jonas, Shivaram Venkataraman, Ion Stoica, Benjamin Recht, and Jonathan Ragan-Kelley. Numpywren: Serverless linear algebra. arXiv preprint arXiv:1810.09679, 2018.</p><p>\\\n[34] Youren Shen, Hongliang Tian, Yu Chen, Kang Chen, Runji Wang, Yi Xu, Yubin Xia, and Shoumeng Yan. Occlum: Secure and efficient multitasking inside a single enclave of intel sgx. In Proceedings of the Twenty-Fifth International Conference on Architectural Support for Programming Languages and Operating Systems, pages 955–970, 2020.</p><p>\\\n[35] Weisong Shi, Jie Cao, Quan Zhang, Youhuizi Li, and Lanyu Xu. Edge computing: Vision and challenges. IEEE Internet of Things Journal, 3(5):637–646, 2016.</p><p>\\\n[36] Ming-Wei Shih, Sangho Lee, Taesoo Kim, and Marcus Peinado. T-sgx: Eradicating controlled-channel attacks against enclave programs. 01 2017.</p><p>\\\n[37] Shweta Shinde, Zheng Leong Chua, Viswesh Narayanan, and Prateek Saxena. Preventing page faults from telling your secrets. In Proceedings of the 11th ACM on Asia Conference on Computer and Communications Security, ASIA CCS ’16, page 317–328, New York, NY, USA, 2016. Association for Computing Machinery. arXiv:2001.04592, 2020.</p><p>\\\n[38] Vikram Sreekanti, Chenggang Wu, Xiayue Charles Lin, Johann Schleier-Smith, Jose M Faleiro, Joseph E Gonzalez, Joseph M Hellerstein, and Alexey Tumanov. Cloudburst: Stateful functions-as-a-service. arXiv preprint</p><p>\\\n[39] Ajay Kumar Tanwani, Nitesh Mor, John Kubiatowicz, Joseph E. Gonzalez, and Ken Goldberg. A Fog Robotics Approach to Deep Robot Learning: Application to Object Recognition and Grasp Planning in Surface Decluttering. In Proceedings of the IEEE International Conference on Robotics and Automation, ICRA, May 2019.</p><p>\\\n[40] Facebook Database Engineering Team. Rocksdb: A persistent key-value store for flash and ram storage. https://rocksdb.org/, May 2021. Accessed: 2021-05-25.</p><p>\\\n[41] Nan Tian, Ajay Kumar Tanwani, Ken Goldberg, and Somayeh Sojoudi. Mitigating Network Latency in CloudBased Teleoperation using Motion Segmentation and Synthesis. In Proceedings of the International Symposium on Robotics Research, ISRR, Oct 2019.</p><p>\\\n[42] Bohdan Trach, Oleksii Oleksenko, Franz Gregor, Pramod Bhatotia, and Christof Fetzer. Clemmys: Towards secure remote execution in faas. In Proceedings of the 12th ACM International Conference on Systems and Storage, pages 44–54, 2019.</p><p>\\\n[43] Chia-Che Tsai, Donald E Porter, and Mona Vij. Graphene-sgx: A practical library os for unmodified applications on sgx. In 2017 USENIX Annual Technical Conference (USENIX ATC 17), pages 645–658, 2017.</p><p>\\\n[44] Rob van der Meulen. What edge computing means for infrastructure and operations leaders. shorturl.at/evwD0.</p><p>\\\n[45] Ofir Weisse, Valeria Bertacco, and Todd Austin. Regaining lost cycles with hotcalls: A fast interface for sgx secure enclaves. ACM SIGARCH Computer Architecture News, 45(2):81–93, 2017.</p><p>\\\n[46] Zhijingcheng Yu, Shweta Shinde, Trevor E Carlson, and Prateek Saxena. Elasticlave: An efficient memory model for enclaves. arXiv preprint arXiv:2010.08440, 2020.</p><p>\\\n[47] Lixia Zhang, Alexander Afanasyev, Jeffrey Burke, Van Jacobson, kc claffy, Patrick Crowley, Christos Papadopoulos, Lan Wang, and Beichuan Zhang. Named Data Networking. ACM SIGCOMM Computer Communication Review, 44(3):66–73, July 2014.</p><p>\\\n[48] Zibin Zheng, Shaoan Xie, Hongning Dai, Xiangping Chen, and Huaimin Wang. An Overview of Blockchain Technology: Architecture, Consensus, and Future trends. In IEEE International Congress on Big Data (BigData Congress), pages 557–564. IEEE, 2017.</p><p>(1) Kaiyuan Chen, University of California, Berkeley (kych@berkeley.edu);</p><p>(2) Alexander Thomas, University of California, Berkeley (alexthomas@berkeley.edu);</p><p>(3) Hanming Lu, University of California, Berkeley (hanming lu@berkeley.edu);</p><p>(4) William Mullen, University of California, Berkeley (wmullen@berkeley.edu);</p><p>(5) Jeff Ichnowski, University of California, Berkeley (jeffi@berkeley.edu);</p><p>(6) Rahul Arya, University of California, Berkeley (rahularya@berkeley.edu);</p><p>(7) Nivedha Krishnakumar, University of California, Berkeley (nivedha@berkeley.edu);</p><p>(8) Ryan Teoh, University of California, Berkeley (ryanteoh@berkeley.edu);</p><p>(9) Willis Wang, University of California, Berkeley (williswang@berkeley.edu);</p><p>(10) Anthony Joseph, University of California, Berkeley (adj@berkeley.edu);</p><p>(11) John Kubiatowicz, University of California, Berkeley (kubitron@berkeley.edu).</p>","contentLength":14253,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Is SCL the Key to Faster, Safer Serverless Apps? Here’s What Benchmarks Say","url":"https://hackernoon.com/is-scl-the-key-to-faster-safer-serverless-apps-heres-what-benchmarks-say?source=rss","date":1759440603,"author":"EScholar: Electronic Academic Papers for Scholars","guid":321,"unread":true,"content":"<p>SCL leverages DataCaspules as the data representation to support inter-enclave communication. To quantify the benefits and limitations, we ask: (1) How does SCL perform as a KVS(§VIII-B)? (2) How do circular buffer (§VIII-D), and replication (§VIII-C) affect the overhead? (3) How long does it take to securely launch a PSL task? (§VIII-E) (4) How much does SCL pay to run in-enclave distributed applications(§VIII-F)?</p><p>\\\nWe evaluate PSL on fifteen Intel NUCs 7PJYH, equiped with Intel(R) Pentium(R) Silver J5005 CPU @ 1.50GHz with 4 physical cores (4 logical threads). The processor has 96K L1 data cache, a 4MiB L2 cache, and 16GB memory. The machine uses Ubuntu 18.04.5 LTS 64bit with Linux 5.4.0- 1048-azure. We run Asylo version 0.6.2. We report the average of experiments that are conducted 10 times. For each NUC, it runs two PSL threads by default.</p><p>\\\n<em>B. End-To-End Benchmark of SCL</em></p><p>\\\n: An end-to-end evaluation of SCL starts the worker sends the first acknowledgement to the user, and ends when the client receives its last request’s response from the workers. We evaluate the performance using a workload generated by YCSB workload generators. Due to the difference between get and put protocols, we focus on the read-only and write-only workloads. All workloads comply zipfian distribution, where keys are accessed at non-uniform frequency. For each get, we evaluate the performance of getting from the local memtable of the lambda(get(cached)), and of getting the data from CapsuleDB(get(uncached)). Each get request is synchronous that the next request is sent only if it gets the value of the previous get request.</p><p>\\\n: Figure 9 shows the throughput of the end-to-end YCSB benchmark. The aggregated throughput of put. The get(CapsuleDB) throughput is flattened as we increate the number of the lambdas, because we run one single CapsuleDB instance that handle all the queries, which is bottlenecked as the number of lambdas that issue get(CapsuleDB) increases.</p><p>\\\n<em>C. Replication-enabled End-To-End Benchmark</em></p><p>\\\n: Replication-enabled end-to-end evaluation measures the performance of the SCL layer with durability. In particular, it includes the overhead of workers sending each write to the DataCapsule replicas, a quorum of DataCapsule replicas receive data and persist it on disk, and then acking the worker. We evaluate the performance using a workload generated by YCSB workload generators. Since replication involves only write operations, we evaluate a writeonly workload. The workload involves a zipfian distribution, with keys accessed at a non-uniform frequency.</p><p>\\\n: Figure 10 illustrates the performance of the DataCapsule backend. It shows that SCL with replication has reached a bottleneck after 9 workers while SCL without durability continues to scale. The performance drop and bottleneck are due to several reasons: 1) disk operations are inherently slow; 2) the burden on replication system’s leader is high for collecting acks from DataCapsule replicas and sending the aggregated ack back to worker. We aim to improve SCL with replication by mitigating the workload on the replication leader.</p><p>\\\n<em>D. Circular Buffer Microbenchmark</em></p><p>\\\n The circular buffer provides efficient application-enclave communication. We compare the perfor-</p><p>\\\nmance of the circular buffer with the SGX SDK baseline and the state-of-the-art HotCall. We evaluate them based on the number of clock cycles required for communications in both the application to enclave direction and vice versa.</p><p>\\\n: As shown in Table I, baseline SGX SDK incurs a significant overhead of over 20,000 clock cycles from application to enclave, and over 8,600 clock cycles from enclave to application. For both directions, HotCall is able to reduce the overhead to under a thousand clock cycles. Our circular buffer reduces overheads even further. Our solution only requires 461.1 and 525.54 clock cycles from application to enclave and vice versa. Compared to state-of-the-art HotCall, our solution provides 103% and 44% improvements, respectively.</p><p>\\\n: We evaluate the launching process of PSL by running Workers and FaaS leader in SGXv2 hardware mode, which the worker lambda, FaaS leader and user on different physical Intel NUCs machines. For each NUC, it runs Asylo AGE in hardware mode with PCE signed by Intel that helps enclave generates attestation assertions. We assume the machines already have the pulled the prebuilt lambda runtime binaries and execute the runtime. The cold-start bootstrapping process lasts 42 seconds on average in our experiment setting.</p><p>\\\n: Figure 11 show the latency breakdown of the launching process. It takes 0.30s for the user to reach out to the scheduler, and for the scheduler to find and forward the encrypted task to the potential workers. Then the workers load associated runtime and data to the enclave, which takes 0.16s. We parallelize the worker loading time with the attestation. that the user remotely attests the FaaS Leader to verify that the FaaS leader is running authenticated code in SGX enclave. After the worker’s enclave file is loaded, it takes 0.103s on average for the FaaS leader to remotely attest the</p><p>\\\nworker enclave. We note that this attestation latency is mostly constituted by the network delay of grpc request and the local attestation assertion generation time of the worker’s AGE, so it does not incur scalability issue with the FaaS leader when multiple workers are launched at the same time.</p><p>\\\n<em>F. Case Study: Fog Robotics Motion Planner</em></p><p>\\\nWe experiment with a sampling-based motion planner that is parallelized to run on multiple concurrent serverless processes, MPLambda [23], and modifying it to use SCL. Most of the porting effort done was to integrate MPLambda’s build system into Asylo. The modification is about 100 LoC. Many system calls that MPLambda uses are proxied by Asylo.</p><p>\\\nUsing MPLambda with SCL, we compute a motion plan running a fetch scenario in which a Fetch mobile manipulator robot [17] declutters a desk. We measure the median wallclock time to find the first solution by the planners. We also measure the median average path cost per time of the lowest cost path the planners return. This captures how efficiently the planners can compute the best path. Because the planner uses random sampling, we run the same computation multiple times with different seeds. As with previous experiments, we run this test on Intel NUCs 7PJYH, equipped with Intel(R) Pentium(R) Silver J5005 CPU @ 1.50GHz with 4 physical cores (4 logical threads). We set a timeout of 600 seconds for the planners to compute a path.</p><p>\\\nWe run up to 8 planners, running on separate Intel NUCs using SCL and comparing this to running MPLamda without SCL. We observe an increase in performance as we scale out the number of planners. Each planner runs computationally heavy workloads and PSL introduces several threads (i.e. crypto actors, zmq clients, OCALL/ECALL handlers) that take away CPU time from the planner thread. Furthermore, MPLambda planners use the Rapidly-exploring random tree (RRT*) [24] algorithm, to search for paths by randomly generating samples from a search space, checking whether the sample is feasible to explore, and adding the sample to a constructed tree data structure. The tree data structure may grow large and take up a significant amount of memory. Memory in SGX is a limited resource and increased memory pressure leads to more misses in the EPC and requiring paging in and out of enclaves frequently. There is work on limiting the memory usage of RRT* by bounding the memory for the tree data structure, which we can adopt in future work. [2].</p><p>(1) Kaiyuan Chen, University of California, Berkeley (kych@berkeley.edu);</p><p>(2) Alexander Thomas, University of California, Berkeley (alexthomas@berkeley.edu);</p><p>(3) Hanming Lu, University of California, Berkeley (hanming lu@berkeley.edu);</p><p>(4) William Mullen, University of California, Berkeley (wmullen@berkeley.edu);</p><p>(5) Jeff Ichnowski, University of California, Berkeley (jeffi@berkeley.edu);</p><p>(6) Rahul Arya, University of California, Berkeley (rahularya@berkeley.edu);</p><p>(7) Nivedha Krishnakumar, University of California, Berkeley (nivedha@berkeley.edu);</p><p>(8) Ryan Teoh, University of California, Berkeley (ryanteoh@berkeley.edu);</p><p>(9) Willis Wang, University of California, Berkeley (williswang@berkeley.edu);</p><p>(10) Anthony Joseph, University of California, Berkeley (adj@berkeley.edu);</p><p>(11) John Kubiatowicz, University of California, Berkeley (kubitron@berkeley.edu).</p>","contentLength":8469,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What Happened When a Pacific Island Was Cut Off From the Internet","url":"https://tech.slashdot.org/story/25/10/02/1917242/what-happened-when-a-pacific-island-was-cut-off-from-the-internet?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759440120,"author":"msmash","guid":273,"unread":true,"content":"The Hunga Tonga-Hunga Ha'apai volcano erupted on January 15, 2022. The pyroclastic flow severed both of Tonga's underwater internet cables. The eruption cut sixty-five miles from the domestic cable and fifty-five miles from the international link to Fiji. Tonga lost all internet access. The cables sit on the ocean floor and carry 95% of the world's international internet traffic. \n\nThe Guardian has a long read on what happened in the aftermath. A.T.M.s (cash machines) stopped working because banks could not verify account balances. Businesses could not file export paperwork. Foreign remittances made up 44% of the country's G.D.P. The government found old satellite phones. Three or four days later, officials restored a hundred and twenty megabytes per second of bandwidth for essential work. A month after the eruption, SpaceX donated fifty Starlink terminals. SubCom's repair ship Reliance took five weeks to restore the international cable. Vava'u did not get broadband back until August, 2023. Another earthquake in the summer of 2024 severed the domestic cable again.","contentLength":1080,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Inside PSL: Key Management, Sandboxing, and Secure Enclaves Explained","url":"https://hackernoon.com/inside-psl-key-management-sandboxing-and-secure-enclaves-explained?source=rss","date":1759439703,"author":"EScholar: Electronic Academic Papers for Scholars","guid":320,"unread":true,"content":"<p>We discuss the experience and implementation effort to use SCL for PSL. Every PSL worker is started with a Worker Enclave in SCL, and attested by In-Enclave FaaS Leader. The code for PSL is directly executed on sandboxed Javascript engine. Our key distribution and management protocol provides every worker enclave with unique private keys derived from a master key by the FaaS Leader. The keys can be easily generated, verified and rotated to prevent potential key leakage.</p><p>\\\nTo isolate in-enclave applications from the PSL infrastructure, we use a sandboxed Javascript interpreter, Duktape, to dynamically interpret the Lambda program at runtime. In order for sandboxed Javascript program communicate with its other counterparts, we modify the Duktape and introduce two functions put and get to interact with SCL. We note that the program is transparent with and sandboxed from the underlying cryptographic schemes, so that it cannot observe and unintentionally leak the cryptographic secrets.</p><p>\\\nPSL builds its attestation protocol on top of the Asylo’s attestation primitives. For each worker or FaaS leader that requires code running in the enclave, it starts with an Assertion Generation Enclave(AGE) as a Quoting Enclave(QE) that helps generates  on behalf of the enclave. The QE is certified by the Provisioning Certification Enclave (PCE), which uses Provisioning Certification Key (PCK) that is written, and distributed by Intel to sign QE’s hardware REPORT. The PCK certificate chain can be traced back to Intel SGX Root Certificate Authority(CA). After receiving an assertion request from a remote attester, the worker or FaaS leader establishes bi-directional local attestation with AGE to forward the assertion request from the remote attester and to get the assertion from the AGE. After the remote attester verifies the assertion, they establish a secure gRPC channel and the remote attester sends confidential information, such as crypographic keys, to the worker or FaaS leader.</p><p>\\\nEach PSL worker node starts a lambda runtime in the enclave, which is registered with a third-party job scheduler. To launch a PSL workload, the user contacts the job scheduler with an encrypted program and corresponding launching configurations, such as how many lambdas are needed. The job scheduler contacts idle worker nodes within its registry and forwards the encrypted program to the potential worker nodes. To prevent malicious worker nodes, the user sends cryptographic keys via a separate channel through FaaS leader that runs in an enclave. After verifies the identity of the FaaS leader using remote attestation, the worker distributes the keys to the FaaS leader. The workers which receive the encrypted program also verify itself with remote attestaion with the FaaS leader. After the workers are authenticated, the FaaS leader forwards the cryptographic keys to the worker nodes, and the worker nodes can decrypt and run the program. When the PSL workload is finished, all the user-related confidential information, such as the content of the memtable, is cleared by a RESET command by the FaaS leader, because restarting the lambda runtime may take longer time. The FaaS leader keeps track of the idleness of the workers and only distribute keys to the idle workers. The workers after RESET need to be re-attested for the next PSL workload.</p><p>\\\nIn PSL, key management is needed for worker enclaves to verify each other’s identity, and to satisfy the security guarantees of DataCapsules. Our key management design goals are: 1) Provenance: by providing a  key pair per worker enclave; 2) Authentication: each worker enclave needs to sign with the (derived) DataCapsule  identity; 3), PSL uses a hierarchical structure with a parent FaaS Leader and multiple child Lambda Enclaves. We want to design a key management scheme to efficiently manage hierarchically structured key pairs with low overhead.</p><p>\\\nTo derive a each set of public/private key pairs from a master key, we use Hierarchical Deterministic (HD) Wallet from Bitcoin Wallet[30]. HD Wallet is a key management scheme that allows all the child public keys to be derived from a single parent public key. We use hardened derived child keys, a scheme of HD wallet to prevent the problem of HD Wallet that the leakage of the child private key leaks the private key of the parent. HD Wallet enables efficient key management in PSL as follows: 1) After attestation between the client and the FaaS Leader, the client sends its owner key to the FaaS Leader. 2) The FaaS Leader generates a child public/private key pair for the current running application. 3) The FaaS Leader uses the application child key pair to generate multiple grandchild key pairs, one per worker enclave. 4) The FaaS Leader attests and sends every enclave its grandchild key pair. 5) FaaS Leader multicasts the application public key to all enclaves. 6) Each worker enclave derives the other worker enclaves’ public keys using the application public key.</p><p>\\\n We enable efficient key rotation scheme with SCL that can derive and distribute a new set of key pairs for the workers from the new hardened key pair. This prevents the cryptographic key leakage over time. This is done by (1) client deriving a new child hardened key pair and multicasting the public key to all enclave workers; (2) the FaaS Leader then derives a new set of key pairs for the workers from the new key pair. To handle lost multicasted messages or enclave worker failure, we can rely on SCL’s consistency coordinator and include the current parent public key in the SYNC reports. This ensures that any enclave worker can verify that they are using the correct signing keys in a given epoch by validating the keys against the consistency coordinator’s SYNC reports. The frequency in which key rotation occurs depends on the user’s threat model. Users may choose to rotate keys per function invocation. This ensures any new function invocations may not affect previous function invocations.</p><p>Our codebase contains 32,454 LoC in C++ excluding comments and 43,011 LoC code base in total counted by cloc[1]. The core SCL KVS code consisted of roughly 4,000 lines of code in C++, excluding the attestation, distributive application implementations, and experiment scripts. We implement the KVS directly on top of Asylo instead of on a containerized enclave environment. This yields a much smaller TCB than related works such as Speicher [9].</p><p>\\\nAsylo is a hardware-agnostic framework for TEEs, supporting Intel SGX(v1 and v2) and ARM TrustZone. It also provided a POSIX compliant library that made it easier to port existing applications into enclaves. We use ZeroMQ to implement network multicast and communications between Worker Enclaves. We use gRPC to create a secure FaaS Leader Enclave, which can generate HD Wallet keypairs and startup enclave workers. We use DukTape, an embedded JavaScript engine in C++, to sandbox enclave applications, now that enclaves can directly execute JavaScript code.</p><p>\\\nCapsuleDB is implemented in C++ and is 2200 LoC. It also uses several features of Asylo and the structures created in the PSL implementation. We use a similar memtable implementation, but leverage mutexes on each entry instead of a spinlock. Due to the implementation timeline, the current version of CapsuleDB writes data to disc rather than to a network attached DataCapsule using the Boost serialization library. The DataCapsule replication service contains about 1,000 LoC in C++ excluding comments. We use RocksDB as embedded persistent storage for each DataCapsule replica, ZeroMQ to implement network communication between DataCapsule replicas, and OpenSSL for signature and verification.</p><p>(1) Kaiyuan Chen, University of California, Berkeley (kych@berkeley.edu);</p><p>(2) Alexander Thomas, University of California, Berkeley (alexthomas@berkeley.edu);</p><p>(3) Hanming Lu, University of California, Berkeley (hanming lu@berkeley.edu);</p><p>(4) William Mullen, University of California, Berkeley (wmullen@berkeley.edu);</p><p>(5) Jeff Ichnowski, University of California, Berkeley (jeffi@berkeley.edu);</p><p>(6) Rahul Arya, University of California, Berkeley (rahularya@berkeley.edu);</p><p>(7) Nivedha Krishnakumar, University of California, Berkeley (nivedha@berkeley.edu);</p><p>(8) Ryan Teoh, University of California, Berkeley (ryanteoh@berkeley.edu);</p><p>(9) Willis Wang, University of California, Berkeley (williswang@berkeley.edu);</p><p>(10) Anthony Joseph, University of California, Berkeley (adj@berkeley.edu);</p><p>(11) John Kubiatowicz, University of California, Berkeley (kubitron@berkeley.edu).</p>","contentLength":8561,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why iRobot’s founder won’t go within 10 feet of today’s walking robots","url":"https://arstechnica.com/ai/2025/10/why-irobots-founder-wont-go-within-10-feet-of-todays-walking-robots/","date":1759439423,"author":"Benj Edwards","guid":352,"unread":true,"content":"<p>When a robotics pioneer who has spent decades building humanoid machines recommends that you stand at least nine feet away from any full-sized walking robot, you should probably listen.</p><p>\"My advice to people is to not come closer than 3 meters to a full-size walking robot,\" Rodney Brooks <a href=\"https://rodneybrooks.com/why-todays-humanoids-wont-learn-dexterity/\">writes</a> in a technical essay titled \"Why Today’s Humanoids Won’t Learn Dexterity\" published on his blog last week. \"Until someone comes up with a better version of a two-legged&nbsp;walking robot that is much safer to be near, and even in contact with, we will not see humanoid robots get certified to be deployed in zones that also have people in them.\"</p><p>Brooks, the <a href=\"https://en.wikipedia.org/wiki/Rodney_Brooks\">MIT professor emeritus</a> who co-founded <a href=\"https://en.wikipedia.org/wiki/IRobot\">iRobot</a> (of Roomba fame) and Rethink Robotics, believes companies pouring billions into humanoid development are chasing an expensive fantasy. Among other problems yet to be addressed, he warns that today's bipedal humanoids are fundamentally unsafe for humans to be near when they walk due to the massive kinetic energy they generate while maintaining balance. That stored-up energy can cause severe injury if the robot falls or its limbs strike someone.</p>","contentLength":1144,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2024/10/optimus_header_1-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Solana Price Prediction Hits $600, But Pepeto Presale Looks Like 100x Best Crypto Investment","url":"https://hackernoon.com/solana-price-prediction-hits-$600-but-pepeto-presale-looks-like-100x-best-crypto-investment?source=rss","date":1759438801,"author":"Tokenwire","guid":319,"unread":true,"content":"<article>Solana’s bull case price prediction points to $600 by 2026, a solid 2–3x from today’s $206, but not portfolio-changing. Pepeto (PEPETO), an Ethereum-based meme coin, has already raised $6.8M in presale, offers 224% staking APY, and features tools like PepetoSwap and a cross-chain bridge. Analysts call it the best crypto investment for 2025 with 100x potential.</article>","contentLength":368,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.18 To More Reliably Handle 255+ vCPUs On AMD EPYC Servers","url":"https://www.phoronix.com/news/Linux-6.18-Better-EPYC-256-vCPU","date":1759438500,"author":"Michael Larabel","guid":730,"unread":true,"content":"<article>For those wanting to run virtual machines with more than 255 vCPUs on modern AMD EPYC servers, an important code refactoring was merged for Linux 6.18 to ensure the proper topology information is exposed to KVM guest VMs...</article>","contentLength":223,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Has Already Run Out of Training Data, Goldman's Data Chief Says","url":"https://slashdot.org/story/25/10/02/191224/ai-has-already-run-out-of-training-data-goldmans-data-chief-says?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759437660,"author":"msmash","guid":272,"unread":true,"content":"AI has run out of training data, according to Neema Raphael, Goldman Sachs' chief data officer and head of data engineering. \"We've already run out of data,\" Raphael said on the bank's podcast. He said this shortage is already shaping how developers build new AI systems. China's DeepSeek may have kept costs down by training on outputs from existing models instead of fresh data. The web has been tapped out. \n\nDevelopers have been using synthetic data -- machine-generated material that offers unlimited supply but carries quality risks. Raphael said he doesn't think the lack of fresh data will be a massive constraint. \"From an enterprise perspective, I think there's still a lot of juice I'd say to be squeezed in that,\" he said. Proprietary datasets held by corporations could make AI tools far more valuable. The challenge is \"understanding the data, understanding the business context of the data, and then being able to normalize it.\"","contentLength":943,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Big Ball of Mud: What You Need to Know About the Antipattern, How to Avoid It, and More","url":"https://hackernoon.com/big-ball-of-mud-what-you-need-to-know-about-the-antipattern-how-to-avoid-it-and-more?source=rss","date":1759437647,"author":"Yan Levin","guid":318,"unread":true,"content":"<p>Probably the most infamous architectural antipattern in frontend development is the . The term Big Ball of Mud is applied to systems that have no discernible structure or modular organization. The codebase has grown organically and chaotically, becoming a maintenance nightmare. </p><p>\\\nIt's a situation many developers find themselves in, particularly when pressed hard to meet deadlines and develop a high volume of features. That's what the current article is about: the Big Ball of Mud antipattern with an example taken from frontend development, why it's so common, when it becomes a problem, and how to address this problem.</p><h2>What is the Big Ball of Mud?</h2><p>The  is a system with poorly defined architectural boundaries. Within such systems, code becomes entangled and highly coupled; hence, maintaining or extending the project becomes problematic. Over time, as more features are added without attention to the overall design, it becomes harder and harder to work with the code. Without structure, making changes in one part of the system too easily breaks other parts, inadvertently introducing bugs that further raise the bar on the complexity of development.</p><p>\\\nIn a , you will often see the following characteristics: NOAA clear separation of concerns: business logic, UI, and fetching of data are interwoven. NOAA loose coupling: the components are intertwined, and therefore, changes are difficult to put in isolation. NOAA modularity: every portion of the system depends on every other portion. NOAA global variables or shared states with unpredictable side effects.</p><p>\\\nThe Big Ball of Mud is a common result of high pressure to deliver fast without due attention to architecture. At the beginning of a project, developers are often in a rush to build functionality as fast as they can, with little time given to adequate planning. This leads to the growth of the codebase in every direction, with new logic being inserted wherever it could fit. Over time, refactoring is delayed or ignored in favor of shipping more features, and the architecture deteriorates.</p><p>\\\nOther contributing factors to this antipattern include:</p><ul><li>: Developers are not coordinating with each other. Inconsistent coding and scattered functionality ensue.</li><li> or architectural principles laid down to guide the development.</li><li>: New features are added on top of what is already messy code without cleaning up the mess.</li></ul><p>\\\nLet's take a closer look at what the Big Ball of Mud might look like on an average frontend project.</p><h2>Example of Big Ball of Mud in Frontend</h2><p>Here's an abstract example of the Big Ball of Mud antipattern in front-end architecture. Consider a small React project that has grown into chaos over time.</p><pre><code>/src\n /components\n   /Header.js\n   /Footer.js\n/Sidebar.js\n   /MainContent.js\n   /UserProfile.js\n /utils\n   /api.js\n   /constants.js\n /styles\n   /globalStyles.css\n /App.js\n /index.js\n</code></pre><h2>Issues With This Architecture:</h2><ul><li><strong>Lack of module boundaries:</strong> The components, say, , , and , all reside in one folder without any consideration for the role each of them plays.</li><li> Components are responsible for fetching data, i.e., API calls, and rendering UI elements. Thus, the tight coupling between logic and presentation layers persists.</li><li> The project depends on a single global CSS file. As your application grows, this might lead to conflicts in styles and will be even harder to maintain. Direct use of APIs in components: The method for fetching and updating data is imported directly into components like , thus mixing data-fetching logic with UI code.</li></ul><h3>Sample Code from :</h3><pre><code>import React, { useState, useEffect } from 'react';\nimport { fetchUserData, updateUserProfile } from './utils/api';\nimport './styles/globalStyles.css'; \n\nconst UserProfile = () =&gt; {\n  const [user, setUser] = useState(null);\n  const [loading, setLoading] = useState(true);\n\n  useEffect(() =&gt; {\n    fetchUserData()\n    .then((data) =&gt; {\n        setUser(data);\n        setLoading(false);\n      })\n      .catch((error) =&gt; console.error('Error fetching user data:', error));\n  }, []);\n\n  const handleUpdate = () =&gt; {\n    updateUserProfile(user)\n      .then(() =&gt; alert('Profile updated!'))\n      .catch((error) =&gt; console.error('Error updating profile:', error));\n  };\n\n  if (loading) return &lt;div&gt;Loading.&lt;/div&gt;;\n\n  return (\n    &lt;div className=\"user-profile\"&gt;\n      &lt;h1&gt;{user.name}&lt;/h1&gt;\n      &lt;button onClick={handleUpdate}&gt;Update Profile&lt;/button&gt;\n    &lt;/div&gt;\n  );\n};\n\nexport default UserProfile;\n</code></pre><ul><li> Data fetching, state management, and UI rendering are all performed in one place within the component.</li><li> The update of the API will force multiple components to be updated, because there is no abstraction layer between the API and the Components.</li><li> Another component desiring access to user data will either reimplement the API call or tightly couple itself to this logic.</li></ul><p>\\\nThis tangled, interdependent code is hard to scale and maintain, which is what a Big Ball of Mud is.</p><h2>When Do the Problems Start?</h2><p>A project featuring this type of architecture may not immediately have apparent signs of trouble. But as the project grows, so do the problems, compounding on top of one another:</p><ul><li> Changes become riskier because bugs in parts of the system unrelated to where the change was made can show up.</li><li> Additional features set without refactoring involve architectural improvements that become more difficult to realize.</li><li> Developers will start taking more time just to navigate and make something sensible out of such messy code, thus slowing down the development of features.</li></ul><p>\\\nThe more knotted it becomes, the harder it is to untangle. Of course, this is just about the vicious spiral of growing technical debt and shrinking productivity.</p><h2>How to Avoid the Big Ball of Mud</h2><p>To avoid the Big Ball of Mud, good architectural habits have to be inculcated early and rigorously enforced during the development process. Some strategies follow.</p><ol><li> Clear division of your code into logical modules with responsibility boundaries. For example, concerns can be separated by data fetching, business logic, and UI rendering.</li><li>: Abstract API calls and data management via services or hooks, such that these concerns are abstracted away from your components. This will help decouple the code and make it easier to handle changes in your API.</li><li>: There should be a well-defined boundary between components. Instead of having all the components located under one folder, create separate folders for a feature or domain.</li><li> Use libraries like Redux, MobX, or React's Context API for shared state management between components. This greatly reduces the urge for a component to manage the state itself.</li><li> Refactor regularly. Don't allow the project to reach a stage where it becomes absolutely impossible to handle anymore; address these concerns while keeping the codebase clean.</li></ol><h2>What to Do If You're Already Stuck in a Big Ball of Mud</h2><p>If your project has already devolved into a Big Ball of Mud, there is hope. The remedy is to  piecemeal, baking architectural principles in where possible. Start by:</p><ul><li> Focus on those parts of the code that are most painful to work with or extend.</li><li> Incrementally refactor components to separate out concerns and limit dependencies. Now, introduce testing: Add unit and integration tests to make sure that your refactoring doesn't break existing functionality.</li></ul><p>In summary, Big Ball of Mud is a very common antipattern causing much trouble in frontend projects. Introduction of modular architecture, separation of concerns, and regular refactoring are definitely steps that would keep the chaos introduced by this pattern from your codebase, making it cleaner and more manageable.</p>","contentLength":7573,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linus Torvalds Vents Over \"Completely Crazy Rust Format Checking\"","url":"https://www.phoronix.com/news/Linus-Torvalds-Rust-Formatting","date":1759436040,"author":"Michael Larabel","guid":729,"unread":true,"content":"<article>After Linus Torvalds yesterday shot down RISC-V big endian prospects for the Linux kernel, today he has used his authority to wage a war on \"crazy\" Rust code formatting as well as to critique poor text formatting...</article>","contentLength":215,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google Says Hackers Are Sending Extortion Emails To Executives","url":"https://tech.slashdot.org/story/25/10/02/1812256/google-says-hackers-are-sending-extortion-emails-to-executives?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759435260,"author":"msmash","guid":271,"unread":true,"content":"An anonymous reader shares a report: Google said hackers are sending extortion emails to an unspecified number of executives, claiming to have stolen sensitive data from their Oracle business applications. In a statement, Google said a group claiming affiliation with the ransomware gang cl0p, opens new tab was sending emails to \"executives at numerous organizations claiming to have stolen sensitive data from their Oracle E-Business Suite.\" Google cautioned that it \"does not currently have sufficient evidence to definitively assess the veracity of these claims.\"","contentLength":567,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Department of Energy cancels $7.5B of clean energy projects in mostly blue states","url":"https://techcrunch.com/2025/10/02/department-of-energy-cancels-7-5b-of-clean-energy-projects-in-mostly-blue-states/","date":1759434826,"author":"Tim De Chant","guid":203,"unread":true,"content":"<article>The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris.</article>","contentLength":181,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Codego Launches Whitelabel Devices Bringing Tokens Into Daily Life","url":"https://hackernoon.com/codego-launches-whitelabel-devices-bringing-tokens-into-daily-life?source=rss","date":1759433537,"author":"Chainwire","guid":317,"unread":true,"content":"<p>Milan, Italy, October 2nd, 2025, Chainwire/-- recently disclosed that its Whitelabel Device Program is now open for business. The program lets crypto projects give away branded devices that give out daily rewards in their own tokens. The move takes tokens out of exchanges and wallets and puts them into homes and everyday life.</p><h3>From In-House Devices to Whitelabel Expansion</h3><ul><li>the connection to a decentralized GPU network, and&nbsp;</li><li>the possibility to generate daily revenue in tokens.&nbsp;</li></ul><p>Going a bit deeper, the team explained that, under the Whitelabel Device Program, rewards will be distributed in USDC through Codego’s app. The model has proven simple and effective: a device in the home that provides consistent daily payouts.</p><p>The new program extends this framework to other projects. Partners can now release their own branded versions, with the same technology delivering rewards in their tokens.</p><h3>A New Layer of Utility for the Token Economy</h3><p>It is the team’s opinion that tokens existing only on exchanges risk fading from relevance. Tokens delivered daily through a tangible device gain visibility, trust, and persistence. Regular payouts create habits, strengthen loyalty, and give tokens staying power.</p><p>Another important thing to mention is that projects can gain new channels for adoption. Also, users see tokens tied to consistent rewards, and not as abstract speculation entities. For partners, the model opens additional revenue streams through device sales and recurring margins.</p><h3>Strategy, Influence, and Power</h3><p>The team working at Codego has a clear long-term view for the project and the whole crypto community. For instance, here are three key features to consider:</p><ul><li>Home devices help the token's brand and presence stand out.&nbsp;</li><li>Daily rewards make people closer to the system. This strategy makes it less convenient for anyone to leave ecosystems.&nbsp;</li><li>Also, a token given out by a real system has the potential of gaining credibility on the market. This is because it’s possible to link real utility to a cryptocurrency. In other words, this system aims to go beyond mere speculation, and to enter the market with real, tangible value.&nbsp;</li></ul><p>Codego Group is regulated as an Electronic Money Institution and already provides services such as Banking-as-a-Service, Cards-as-a-Service, and Device-as-a-Service.</p><p>The Whitelabel Device Program brings something new to the table, forcing crypto tokens from speculative devices to owning real-world utility. It builds a foundation where tokens integrate into daily life, offering relevance and stability in a volatile market.</p><p> builds the financial and blockchain infrastructure that businesses and people use. It offers services for payments, banking, and devices. The recent launch is a big step in the company’s overall roadmap. In fact, it potentially increases the adoption of crypto tokens in various sectors.</p><p>Partners receive USDC directly from Codego while distributing their own tokens to users through branded devices.</p><p>Codego gives projects tools that make them more resilient and relevant by putting tokens into everyday life. The  and the links listed below have more information on this growing initiative.</p><p>:::tip\n<em>This story was published as a press release by Chainwire under HackerNoon’s Business Blogging&nbsp;. Do Your Own Research before making any financial decision.</em></p>","contentLength":3319,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Walmart To Deploy Sensors To Track 90 Million Grocery Pallets by Next Year","url":"https://tech.slashdot.org/story/25/10/02/180240/walmart-to-deploy-sensors-to-track-90-million-grocery-pallets-by-next-year?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759432860,"author":"msmash","guid":270,"unread":true,"content":"Walmart plans to deploy sensors across its 4,600 US stores by the end of 2026 to track 90 million pallets of groceries shipped annually [Editor's note: non-paywalled source]. The retailer and technology vendor Wiliot announced the expansion Thursday. The sensors will monitor the location, condition and temperature of perishables as they move from warehouses to stores. Walmart started testing Wiliot's sensors at a Texas warehouse in 2023 and has expanded to 500 locations. The full rollout will cover the retailer's US store network and 40 distribution centers. \n\nThe microchips measure 0.7 square millimeters and are embedded in shipping labels. They use Bluetooth to transmit real-time data about pallets. Walmart previously relied on manual scanning and paper checks by employees. The Arkansas-based company employs 2.1 million people but increased revenues by $150 billion over five years without adding workers. Walmart accounts for more than a fifth of US grocery sales.","contentLength":979,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Living Security Unveils HRMCon 2025 Speakers as Report Finds Firms Detect Just 19% Of Human Risk","url":"https://hackernoon.com/living-security-unveils-hrmcon-2025-speakers-as-report-finds-firms-detect-just-19percent-of-human-risk?source=rss","date":1759432341,"author":"CyberNewswire","guid":316,"unread":true,"content":"<p>Austin / TX, United States, September 25th, 2025/CyberNewsWire/--Living Security, a global leader in Human Risk Management (HRM), today announced the full speaker lineup for the , taking place October 20, 2025, at Austin’s Q2 Stadium and virtually worldwide.</p><p>The announcement follows findings from the newly published , produced by the Cyentia Institute in collaboration with Living Security, which reveals that on average, organizations detect only 19% of all human risk activity.</p><p>That means the majority of risky behaviors — from credential misuse to insider threats — go unseen, leaving enterprises exposed to risks that technology or traditional awareness programs alone can’t solve.</p><p>HRMCon is a one-day event focused on the people side of cybersecurity, offered this year both in-person in Austin and virtually worldwide. The program is designed for CISOs, security leaders, risk managers, and HR professionals who are responsible for building security culture and reducing human-driven risk. </p><p>Sessions will explore how to extend risk ownership beyond traditional awareness programs and the security operations center, empowering managers and employees across the business to take accountability. </p><p>Attendees will gain practical strategies they can apply immediately from executives, global analysts, and peers. Participants with confirmed attendance may also request a completion certificate for Continuing Professional Education (CPE) credits for the full conference.</p><blockquote><p>“Closing that visibility gap requires new strategies, proven frameworks, and collaboration across functions — which is exactly what HRMCon is designed to deliver. No matter where you are in your HRM journey, you’ll walk away with practical playbooks, proven strategies, and inspiring stories you can apply immediately. This isn’t just another security event—it’s a launchpad for making human risk a managed business function, all without pulling you away from your day-to-day responsibilities.”</p></blockquote><p>HRMCon 2025 will feature enterprise CISOs, Fortune 500 veterans, and leading analysts sharing research-backed strategies and real-world lessons on operationalizing human risk management.</p><p>Opening Keynote – Brett Wahlin, CISO, Aurora – From Counterintelligence to Cybersecurity: Rethinking the Human Factor Across Industries.</p><p>Risk frameworks have shaped enterprise security for decades but often overlook the human element. Drawing on his path from counterintelligence to the CISO seat, Brett Wahlin will show where traditional frameworks succeed, where they fall short, and how Human Risk Management can integrate people into the same disciplined approach that governs technology.</p><p>Tim Taylor, VP of Security Education and Awareness, Mastercard – Creating Human Risk Visibility: Where to Start and How to Scale.</p><p>Tim offers a step-by-step play for creating measurable human risk visibility in 90 days. Attendees will learn how to define goals, connect data sources, and build momentum toward sustainable risk reduction.</p><p>Ashley Atiles, Director of Identity Risk, &amp; Alfonso Mancuso, Director of Information Security, Labcorp – The Access Equation: Identity Meets Human Risk.</p><p>Ashley and Alfonso will explore how identity and behavior intersect as the earliest line of defense. Attendees will learn how integrating IAM signals with human risk data creates a powerful new lever for stopping threats before they escalate.</p><p>Kelly Harward, VP of Product &amp; Mike Siegel, President, Living Security – Operationalizing HRM: From Frameworks and Playbooks to Goals for Adaptive Defense.</p><p>Living Security leaders show how to translate frameworks into measurable outcomes. Attendees will see real-world playbooks and a preview of the new Goals feature, which ties behavior change directly to risk reduction.</p><p>Jinan Budge, VP &amp; Principal Analyst, Forrester – The Future of Human Risk Management: Market Landscape and the Role of Agentic AI.</p><p>A market-level view of how Human Risk Management is evolving from compliance to strategy. Attendees will learn about the current state of the market, where it’s headed, and how autonomous AI agents are set to reshape HRM strategies in the years ahead.</p><p>Closing Keynote – Larry Whiteside Jr., CISO Advisor &amp; Co-Founder, Confide – Evolving the Role of the CISO: From Defense to Business Enabler.</p><p>A concise look at how the CISO role is shifting from technical defense to strategic business leadership. Attendees will hear how Human Risk Management can help CISOs align security with culture, accountability, and measurable business outcomes.</p><ul><li>Grounded in Research: Learning real-world strategies to close the 19% human risk visibility gap.</li><li>Professional Development: Earning verifiable CPE credits with a completion certificate (confirmed attendance and upon request).</li><li>Free and Flexible: Registering at no cost and choose to attending live in Austin or virtually from anywhere.</li><li>Expert-Led: Hearing from leading CISOs, analysts, and security practitioners shaping the HRM market.</li><li>Peer Insights: Seeing how organizations are operationalizing HRM through case studies and playbooks.</li><li>Immediate Takeaways: Leaving with frameworks, tools, and strategies you can implement right away.</li></ul><p>HRMCon 2025, hosted by Living Security, comes at a pivotal time for organizations looking to transform security culture, reduce human-driven risk, and lead in an AI-enabled world.</p><p>Living Security is the global leader in Human Risk Management (HRM), providing a risk-informed approach that meets organizations where they are—whether that’s starting with AI-based phishing simulations, intelligent behavior-based training, or implementing a full HRM strategy that correlates behavior, identity, and threat data streams.</p><p>Living Security’s Unify platform delivers 3X more visibility into human risk than traditional, compliance-based training platforms by eliminating siloed data and integrating across the security ecosystem. </p><p>The platform pinpoints the 8–12% of users who pose the greatest risk and automates targeted interventions in real time—reducing exposure to human risk by over 90%. Powered by AI, human analysis, and industry-wide threat telemetry, Unify transforms fragmented signals into intelligent, adaptive defense.</p><p>Named a Global Leader in Human Risk Management by Forrester and trusted by enterprises like Unilever, Mastercard, Merck, and Abbott Labs, Living Security helps security teams move from awareness to action—driving measurable behavior change and proving impact at every stage of the journey.</p><p>:::tip\n<em>This story was published as a press release by Cybernewswire under HackerNoon’s Business Blogging&nbsp;. Do Your Own Research before making any financial decision.</em></p>","contentLength":6665,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Anthropic hires new CTO with focus on AI infrastructure","url":"https://techcrunch.com/2025/10/02/anthropic-hires-new-cto-with-focus-on-ai-infrastructure/","date":1759431639,"author":"Russell Brandom","guid":202,"unread":true,"content":"<article>As part of the change, Anthropic is updating the structure of its core technical group, bringing the company's product-engineering team into closer contact with the infrastructure and inference teams. </article>","contentLength":201,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Solana And Pepeto Emerge As Best Crypto To Invest In, As Sui Price Prediction Weakens","url":"https://hackernoon.com/solana-and-pepeto-emerge-as-best-crypto-to-invest-in-as-sui-price-prediction-weakens?source=rss","date":1759431600,"author":"Tokenwire","guid":315,"unread":true,"content":"<article>Solana (SOL) continues steady growth with strong institutional support, while Sui (SUI) faces bearish pressure near $3.50. Pepeto (PEPETO), in presale at $0.000000156 with $6.8M raised, offers 223% APY staking, zero-fee PepetoSwap, and real utility on Ethereum. Analysts call Pepeto the best crypto to invest in now, with 50x–100x potential in 2025.</article>","contentLength":351,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linkedin CEO Says Fancy Degrees Will Matter Less in the Future of Work","url":"https://slashdot.org/story/25/10/02/179232/linkedin-ceo-says-fancy-degrees-will-matter-less-in-the-future-of-work?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759430460,"author":"msmash","guid":269,"unread":true,"content":"Top college degrees may no longer provide the edge they once did in the job market, per LinkedIn CEO Ryan Roslansky. \"I think the mindset shift is probably the most exciting thing because my guess is that the future of work belongs not anymore to the people that have the fanciest degrees or went to the best colleges, but to the people who are adaptable, forward thinking, ready to learn, and ready to embrace these tools,\" Roslansky said. \"It really kind of opens up the playing field in a way that I think we've never seen before.\" \n\nA 2024 Microsoft survey found 71% of business leaders would choose less-experienced candidates with AI skills over experienced candidates without them. LinkedIn data showed job postings requiring AI literacy increased about 70% year-over-year. Roslansky said AI will not replace humans but people who embrace AI will replace those who don't.","contentLength":878,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ZLUDA 5 Released With An Offline Compiler For CUDA On Non-NVIDIA GPUs","url":"https://www.phoronix.com/news/ZLUDA-5-Released","date":1759429928,"author":"Michael Larabel","guid":728,"unread":true,"content":"<article>ZLUDA 5 is out today as the newest version of this open-source software for running CUDA software on non-NVIDIA GPUs...</article>","contentLength":119,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenAI’s Sora soars to No. 3 on the US App Store","url":"https://techcrunch.com/2025/10/02/openais-sora-soars-to-no-3-on-the-u-s-app-store/","date":1759429494,"author":"Sarah Perez","guid":201,"unread":true,"content":"<article>Sora becomes the No. 3 US app after 164K downloads in 2 days, making the AI video app an early hit. </article>","contentLength":100,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"YouTubers aren’t relying on ad revenue anymore — here’s how some are diversifying","url":"https://techcrunch.com/2025/10/02/youtubers-arent-relying-on-ad-revenue-anymore-heres-how-some-are-diversifying/","date":1759428385,"author":"Lauren Forristal","guid":200,"unread":true,"content":"<article>YouTubers are no longer just creators, and in some cases, their side businesses are growing faster than their channels.</article>","contentLength":119,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Earth Is Getting Darker, Literally, and Scientists Are Trying To Find Out Why","url":"https://news.slashdot.org/story/25/10/02/1659218/earth-is-getting-darker-literally-and-scientists-are-trying-to-find-out-why?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759428060,"author":"msmash","guid":268,"unread":true,"content":"An anonymous reader shares a report: It's not the vibes; Earth is literally getting darker. Scientists have discovered that our planet has been reflecting less light in both hemispheres, with a more pronounced darkening in the Northern hemisphere, according to a study published on Monday in Proceedings of the National Academy of Sciences. \n\nThe new trend upends longstanding symmetry in the surface albedo, or reflectivity, of the Northern and Southern hemispheres. In other words, clouds circulate in a way that equalizes hemispheric differences, such as the uneven distribution of land, so that the albedos roughly match -- though nobody knows why. \"There are all kinds of things that people have noticed in observations and simulations that tend to suggest that you have this hemispheric symmetry as a kind of fundamental property of the climate system, but nobody's really come up with a theoretical framework or explanation for it,\" said Norman Loeb, a physical scientist at NASA's Langley Research Center, who led the new study. \"It's always been something that we've observed, but we haven't really explained it fully.\" \n\nTo study this mystery, Loeb and his colleagues analyzed 24 years of observations captured since 2000 by the Clouds and the Earth's Radiant Energy System (CERES), a network of instruments placed on several NOAA and NASA satellites. Instead of an explanation for the strange symmetry, the results revealed an emerging asymmetry in hemispheric albedo; though both hemispheres are darkening, the Northern hemisphere shows more pronounced changes which challenges \"the hypothesis that hemispheric symmetry in albedo is a fundamental property of Earth,\" according to the study.","contentLength":1702,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Google’s Jules enters developers’ toolchains as AI coding agent competition heats up","url":"https://techcrunch.com/2025/10/02/googles-jules-enters-developers-toolchains-as-ai-coding-agent-competition-heats-up/","date":1759428000,"author":"Jagmeet Singh","guid":199,"unread":true,"content":"<article>Jules is already being used by developers to complete code after experimenting on vibe-coding platforms.</article>","contentLength":104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Japan is Running Out of Its Favorite Beer After Ransomware Attack","url":"https://slashdot.org/story/25/10/02/1559205/japan-is-running-out-of-its-favorite-beer-after-ransomware-attack?utm_source=rss1.0mainlinkanon&utm_medium=feed","date":1759425660,"author":"msmash","guid":267,"unread":true,"content":"Japan is just a few days away from running out of Asahi Super Dry as the producer of the nation's most popular beer wrestles with a devastating cyber attack that has shut down its domestic breweries. From a report: The vast majority of Asahi Group's 30 factories in Japan have not operated since Monday after the attack disabled its ordering and delivery system, the company said. Retailers are already expecting empty shelves as the outage stretches into its fourth day with no clear timeline for factories recommencing operations. Super Dry could also run out at izakaya pubs, which rely on draught and bottles. \n\nLawson, one of Japan's big convenience stores, said in a statement that it stocks many Asahi Group products and \"it is possible that some of these products may become increasingly out of stock from tomorrow onwards.\" \"This is having an impact on everyone,\" said an executive at another of Japan's major retailers. \"I think we will run out of products soon. When it comes to Super Dry, I think we'll run out in two or three days at supermarkets and Asahi's food products within a week or so.\"","contentLength":1107,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Where Will Taiwan Get Energy After Its Failed Nuclear Referendum?","url":"https://spectrum.ieee.org/nuclear-energy-taiwan-maanshan-plant","date":1759424405,"author":"Yu-Tzu Chiu","guid":130,"unread":true,"content":"<p>Semiconductors and AI still require plenty of power</p>","contentLength":51,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTY4OTkwNS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTgxODM2MzEwMH0.i2NImOJQQScayv-fLx-BB6KlEvcBV9Ju6BZDa6V1SC8/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Predicting PE Mortality: Enhancing Clinical Risk Assessment with AI and Multimodal Deep Learning","url":"https://hackernoon.com/predicting-pe-mortality-enhancing-clinical-risk-assessment-with-ai-and-multimodal-deep-learning?source=rss","date":1759424403,"author":"Tomography","guid":313,"unread":true,"content":"<p>: Pulmonary embolism (PE) is a significant cause of mortality in the United States. The objective of this study is to implement deep learning (DL) models using Computed Tomography Pulmonary Angiography (CTPA), clinical data, and PE Severity Index (PESI) scores to predict PE mortality.</p><p>\\\n 918 patients (median age 64 years, range 13-99 years, 52% female) with 3,978 CTPAs were identified via retrospective review across three institutions. To predict survival, an AI model was used to extract disease-related imaging features from CTPAs. Imaging features and/or clinical variables were then incorporated into DL models to predict survival outcomes. Four models were developed as follows: (1) using CTPA imaging features only; (2) using clinical variables only; (3) multimodal, integrating both CTPA and clinical variables; and (4) multimodal fused with calculated PESI score. Performance and contribution from each modality were evaluated using concordance index (c-index) and Net Reclassification Improvement, respectively. Performance was compared to PESI predictions using the Wilcoxon signed-rank test. Kaplan-Meier analysis was performed to stratify patients into high- and low-risk groups. Additional factor-risk analysis was conducted to account for right ventricular (RV) dysfunction.</p><p>\\\n: For both data sets, the PESI-fused and multimodal models achieved higher c-indices than PESI alone. Following stratification of patients into high- and low-risk groups by multimodal and PESI-fused models, mortality outcomes differed significantly (both p&lt;0.001). A strong correlation was found between high-risk grouping and RV dysfunction.</p><p>\\\n: Multiomic DL models incorporating CTPA features, clinical data, and PESI achieved higher c-indices than PESI alone for PE survival prediction.</p><p>AI = Artificial Intelligence</p><p>\\\nc-index = Concordance Index</p><p>\\\nCoxPH = Cox Proportional Hazards</p><p>\\\nCTPA = Computed Tomography Pulmonary Angiography</p><p>\\\nPE = Pulmonary Embolism</p><p>\\\nPESI = Pulmonary Embolism Severity Index</p><p>\\\nRSF = Random Survival Forest</p><p>\\\nTTE, TEE = Transthoracic, Transesophageal Echocardiography</p><p>(1) Zhusi Zhong, BS, a Co-first authors from Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA, Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA, and School of Electronic Engineering, Xidian University, Xi’an 710071, China;</p><p>(2) Helen Zhang, BS, a Co-first authors from Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(3) Fayez H. Fayad, BA, a Co-first authors from Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(4) Andrew C. Lancaster, BS, Department of Radiology and Radiological Sciences, Johns Hopkins University School of Medicine, Baltimore, MD, 21205, USA and Johns Hopkins University School of Medicine, Baltimore, MD, 21205, USA;</p><p>(5) John Sollee, BS, Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(6) Shreyas Kulkarni, BS, Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(7) Cheng Ting Lin, MD, Department of Radiology and Radiological Sciences, Johns Hopkins University School of Medicine, Baltimore, MD, 21205, USA;</p><p>(8) Jie Li, PhD, School of Electronic Engineering, Xidian University, Xi’an 710071, China;</p><p>(9) Xinbo Gao, PhD, School of Electronic Engineering, Xidian University, Xi’an 710071, China;</p><p>(10) Scott Collins, Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(11) Colin Greineder, MD, Department of Pharmacology, Medical School, University of Michigan, Ann Arbor, MI, 48109, USA;</p><p>(12) Sun H. Ahn, MD, Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(13) Harrison X. Bai, MD, Department of Radiology and Radiological Sciences, Johns Hopkins University School of Medicine, Baltimore, MD, 21205, USA;</p><p>(14) Zhicheng Jiao, PhD, Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA;</p><p>(15) Michael K. Atalay, MD, PhD, Department of Diagnostic Radiology, Rhode Island Hospital, Providence, RI, 02903, USA and Warren Alpert Medical School of Brown University, Providence, RI, 02903, USA.</p>","contentLength":4770,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Solana Price Targets $300 While Pepeto Presale Nears $7M With 100x Potential","url":"https://hackernoon.com/solana-price-targets-$300-while-pepeto-presale-nears-$7m-with-100x-potential?source=rss","date":1759424400,"author":"Tokenwire","guid":314,"unread":true,"content":"<article>Solana (SOL) is trending bullish near $225 with targets up to $300, backed by DeFi and institutional adoption. But Pepeto (PEPETO), still in presale at $0.000000156 with $6.9M raised, offers 223% staking APY, zero-fee PepetoSwap, and 850+ listing requests. Analysts say Pepeto could deliver 100x upside in 2025, making it the presale to watch.</article>","contentLength":343,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Threads takes on X with new communities feature","url":"https://techcrunch.com/2025/10/02/threads-takes-on-x-with-new-communities-feature/","date":1759424400,"author":"Sarah Perez","guid":198,"unread":true,"content":"<article>The idea, explains Meta, is to give users dedicated spaces within the app where they can delve deeper into conversations on topics that matter to them.</article>","contentLength":151,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Future of LATAM Payments Is Licensed","url":"https://hackernoon.com/the-future-of-latam-payments-is-licensed?source=rss","date":1759421903,"author":"LaFinteca","guid":312,"unread":true,"content":"<p>LaFinteca’s new authorization in Brazil reflects a strategy of building innovation on regulatory foundations, not shortcuts.</p><p>Latin America is often celebrated as a payments laboratory. Brazil’s Pix moves more than $1 trillion a year, Peru is standardizing QR payments, and Mexico’s SPEI has become everyday infrastructure. On the surface, it looks like pure tech adoption. But beneath that growth lies a less glamorous, more decisive factor: regulation.</p><p>At LaFinteca, we’ve just added a new license to our regulatory footprint. The Central Bank of Brazil has authorized us as an Instituição de Pagamento (Electronic Money Institution) — a license that puts us under direct regulatory supervision in the country. For us, this is not only a compliance milestone. It’s the foundation for building a payment ecosystem that merchants and consumers can trust for the long haul.</p><p>Operating without oversight might look faster in the short term. In reality, it creates fragility: opaque onboarding, patchy settlement, and exposure to regulatory intervention. Licensing flips that script. It forces infrastructure to be transparent, auditable, and built for scale.</p><p>In Brazil, where more than 140 million people use digital payments, that level of trust isn’t optional. It’s a precondition for growth.</p><p>Our approach is simple: compliance first, product second. By aligning with Brazil’s EMI framework, we are able to integrate directly with Pix and move forward with the next steps required for wallet infrastructure, merchant settlement, and API development — all under the guardrails of one of the most respected regulators in the region.</p><p>It’s not the fastest route on paper, but it’s the most sustainable one in practice.</p><p>For businesses looking to enter LATAM, licensing translates into clarity:</p><ul><li>Predictable operations: Merchants know payments will flow under national financial law.</li><li>Fewer surprises: Settlement and reconciliation are designed with regulatory checks in mind.</li><li>Scalability: Compliance isn’t a bottleneck; it’s what allows scale without disruption.</li></ul><p>Regulation doesn’t make the headlines the way flashy product launches do. Yet it’s the reason those products can endure. For LaFinteca, Brazil’s new EMI license is not the finish line — it’s the platform from which the next phase of secure, scalable, cross-border payments in LATAM will be built.</p><p>LaFinteca is a Barcelona- and São Paulo-based payment institution building seamless financial infrastructure for Latin America. Through a single integration, LaFinteca enables merchants to access local payment rails while ensuring compliance with national regulations. Our mission is to simplify payments, accelerate cross-border trade, and expand financial inclusion across the region.</p>","contentLength":2766,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How startups could be affected by a prolonged government shutdown","url":"https://techcrunch.com/2025/10/02/how-startups-could-be-affected-by-a-prolonged-government-shutdown/","date":1759421122,"author":"Dominic-Madori Davis","guid":197,"unread":true,"content":"<article>Slow or stopped permitting and a frozen visa process are existential threats for some startups. </article>","contentLength":96,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The HackerNoon Newsletter: I - vengers: Identity Wars (10/2/2025)","url":"https://hackernoon.com/10-2-2025-newsletter?source=rss","date":1759421078,"author":"Noonification","guid":311,"unread":true,"content":"<p>🪐 What’s happening in tech today, October 2, 2025?</p><p>By <a href=\"https://hackernoon.com/u/startupsoftheweek\">@startupsoftheweek</a> [ 4 Min read ] Discover why good startups get ignored and how to close the validation gap with storytelling, third-party proof, and smart distribution. <a href=\"https://hackernoon.com/your-startup-wont-scale-until-you-close-the-validation-gap\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/ainativedev\">@ainativedev</a> [ 3 Min read ] Explore 8 powerful AI tools, from Gemini CLI to Mem0, that streamline coding, testing, and debugging. <a href=\"https://hackernoon.com/8-ai-tools-that-you-should-be-excited-about-and-adopt\">Read More.</a></p><p>By <a href=\"https://hackernoon.com/u/oliveremeka\">@oliveremeka</a> [ 7 Min read ] Explore digital identity wars: centralized vs decentralized models, blockchain SSI, and verifiable credentials shaping online privacy and security. <a href=\"https://hackernoon.com/i-vengers-identity-wars\">Read More.</a></p><p>🧑‍💻 What happened in your world this week?</p><p>We hope you enjoy this worth of free reading material. Feel free to forward this email to a nerdy friend who'll love you for it.See you on Planet Internet! With love, \n The HackerNoon Team ✌️</p>","contentLength":816,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Story of Engineering Is the Story of Scale","url":"https://spectrum.ieee.org/engineering-scale","date":1759420803,"author":"Harry Goldstein","guid":129,"unread":true,"content":"<p>Ambitious projects showcase engineering at scales big and small</p>","contentLength":63,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTYxNzYzNy9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTgwNzk4MzAxN30.kr26HmweTaBaBhsEcFWkEt8CMGenDQC7HKGoBx1ITZI/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"Celebrating the partners driving Disrupt’s big ideas, connections, and community","url":"https://techcrunch.com/2025/10/02/celebrating-the-partners-driving-disrupts-big-ideas-connections-and-community/","date":1759420800,"author":"Cindy Zackney","guid":196,"unread":true,"content":"<article>TechCrunch Disrupt 2025 wouldn’t be possible without the incredible support of our sponsors, who bring world-class expertise, bold innovation, and community energy to every corner of the conference.</article>","contentLength":200,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ex-OpenAI researcher dissects one of ChatGPT’s delusional spirals","url":"https://techcrunch.com/2025/10/02/ex-openai-researcher-dissects-one-of-chatgpts-delusional-spirals/","date":1759419985,"author":"Maxwell Zeff","guid":195,"unread":true,"content":"<article>A former OpenAI researcher looked into how ChatGPT can mislead delusional users about their reality and its own capabilities.</article>","contentLength":125,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Alexander Jabbour on Building Real-Time Sales AI From 0-to-1 at Rilla","url":"https://hackernoon.com/alexander-jabbour-on-building-real-time-sales-ai-from-0-to-1-at-rilla?source=rss","date":1759419899,"author":"Jon Stojan Journalist","guid":310,"unread":true,"content":"<article>Alexander Jabbour, Engineering Lead at Rilla, built a real-time AI sales coaching platform that turns reactive feedback into live guidance. Overcoming technical hurdles in audio streaming, low-latency transcription, and AI insights, his team scaled the product to multi-million revenue. Early pilots showed close rates rising from 29% to 34%, validating a user-centric, data-driven 0-to-1 journey.</article>","contentLength":397,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Perplexity’s Comet AI browser now free; Max users get new ‘background assistant’","url":"https://techcrunch.com/2025/10/02/perplexitys-comet-ai-browser-now-free-max-users-get-new-background-assistant/","date":1759419369,"author":"Rebecca Bellan","guid":194,"unread":true,"content":"<article>AI search startup Perplexity is making its new Comet browser available to everyone in the world for free&nbsp;as it works to position the product against big browsers and search engines.&nbsp;For certain paid subscribers, the startup has also launched a new ‘background assistant’ to handle multiple tasks via Comet.&nbsp;&nbsp;</article>","contentLength":316,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shaping the Future of Healthcare Through AI and Cloud Data Engineering","url":"https://hackernoon.com/shaping-the-future-of-healthcare-through-ai-and-cloud-data-engineering?source=rss","date":1759418999,"author":"Jon Stojan Journalist","guid":309,"unread":true,"content":"<article>Independent researcher Sanjay Nakharu Prasad Kumar highlights how AI and cloud data engineering are redefining healthcare. Predictive analytics, advanced diagnostic imaging, and AI-driven clinical decision support boost accuracy and efficiency, while IoT-enabled monitoring enhances early detection. Yet challenges around bias, privacy, and workflow integration underscore the need for responsible, transparent adoption.</article>","contentLength":420,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Getting Value from Skip-Level Conversations","url":"https://spectrum.ieee.org/getting-value-skip-level-meeting","date":1759418866,"author":"Rahul Pandey","guid":128,"unread":true,"content":"<p>They're a unique opportunity to accelerate your career</p>","contentLength":54,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy81OTEwNDExMC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc2MjIxNDM1NH0.KU_HC9RlAuzaq6NFugnkIjhO6mrvJzTfytOINkYN-Lg/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"Amazon now lets Prime members add items to upcoming orders with one tap","url":"https://techcrunch.com/2025/10/02/amazon-now-lets-prime-members-add-items-to-upcoming-orders-with-one-tap/","date":1759418813,"author":"Sarah Perez","guid":193,"unread":true,"content":"<article>Amazon's new \"Add to today's delivery\" button makes it easier for Prime members to buy more and tack on items to existing orders.</article>","contentLength":129,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Rivian’s best-case guess for 2025 sales is a 16% drop from last year","url":"https://techcrunch.com/2025/10/02/rivians-best-case-guess-for-2025-sales-is-a-16-drop-from-last-year/","date":1759418354,"author":"Sean O'Kane","guid":192,"unread":true,"content":"<article>The company will likely sell fewer EVs this year than in both 2024 and 2023, making next year's launch of the R2 SUV even more important.</article>","contentLength":137,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"SiFive Premier P550, Apple M2 Pro/Max/Ultra DTs & Other SoC Changes For Linux 6.18","url":"https://www.phoronix.com/news/Linux-6.18-SoC-DT-Changes","date":1759418204,"author":"Michael Larabel","guid":727,"unread":true,"content":"<article>The many SoC and platform/machine DeviceTree additions have been merged for the Linux 6.18 kernel! This includes finally having mainline support for the SiFive HiFive Premier P550 RISC-V development board and its EIC7700 SoC, Apple M2 Pro / Max / Ultra DeviceTrees added and associated Apple Mac system support, various new Snapdragon X1 laptops now being supported by the mainline kernel and much more...</article>","contentLength":405,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Solana And BNB Grow Steady While Pepeto Presale Explodes With $6.8M Raised","url":"https://hackernoon.com/solana-and-bnb-grow-steady-while-pepeto-presale-explodes-with-$68m-raised?source=rss","date":1759418099,"author":"Tokenwire","guid":308,"unread":true,"content":"<article>Pepeto (PEPETO) is exploding in presale with $6.8M raised and tools like PepetoSwap and cross-chain support, drawing hype as the “BNB of memecoins.” Solana (SOL) shows strong ETF-backed growth with $1,000 targets, while Binance Coin (BNB) climbs toward $1,500. Analysts see Pepeto as the breakout play of 2025, mixing meme buzz with real DeFi utility.</article>","contentLength":355,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Your Startup Won’t Scale Until You Close the Validation Gap","url":"https://hackernoon.com/your-startup-wont-scale-until-you-close-the-validation-gap?source=rss","date":1759417207,"author":"Startups Of The Week","guid":307,"unread":true,"content":"<p>Today, you can nomad your way around the world, living in homes owned and cared for by individuals/families looking to make passive income thanks to <a href=\"https://hackernoon.com/company/airbnb\">Airbnb</a>. The company’s product-market fit seems so obvious now but, once upon a time, multiple investors shrugged the idea off, insisting that “no one would want to stay in a stranger’s home.”</p><p>Or take <a href=\"https://hackernoon.com/company/netflix\">Netflix</a>. The streaming giant once begged Blockbuster to buy them for $50 million. Blockbuster laughed them out of the room. Fast-forward a decade, and Netflix became the company that disrupted Blockbuster into extinction.</p><p>If there’s a pattern in these stories, it’s that being ignored is often the first chapter in a startup’s story. So don’t beat yourself up for being overlooked at first. However, <strong>eventually, the right people must discover and champion your cause if you’re going to scale.</strong></p><h2>Why do Good Startups Get Ignored?</h2><blockquote><p><em>Short answer: The Validation Gap</em></p></blockquote><p>This is the space between a Startup having a viable product and the outside world (investors, customers, press, or partners)  it’s viable.</p><p><strong>You know your startup lives in this space when:</strong></p><ul><li>You have early traction, but no one outside your bubble knows or cares.</li><li>The customers you’ve painstakingly acquired love you, but investors aren’t buying it.</li><li>You’re “real” to you and your users, but “invisible” to the broader market.</li></ul><p>I can hazard a guess as to what your next question is:</p><h3>Why does the validation gap exist?</h3><ul><li> Ideas come to us all, and thousands of founders turn them into startups every month. Without strong validation, yours may never rise above the noise.</li><li><strong>Lack of backing from a trustworthy third party:</strong> Most investors won’t care about your product/service until other trustworthy people or establishments tell them that they need to.</li><li> This is self-explanatory. If you’re not publishing stories, data, or insights, you simply don’t exist online.</li><li> Metrics are great, but a narrative that communicates momentum and credibility is even better.</li></ul><p><strong>The Validation Gap is a tricky, sunken place.</strong></p><p>\\\n<strong>But it’s not a death sentence for your business. Here’s how to close it.</strong></p><h2>How to Close the Validation Gap</h2><ol><li><strong>Consistently Publish Your Story (Somewhere People Will Actually Read it)</strong></li></ol><p>Your company blog is a great start. But, if we’re being honest, most of the time, only your employees and a handful of early customers actually read it. To really put yourself out there, you need to publish where a large, tech-curious audience already hangs out.</p><p>There are plenty of platforms out there, but with over 4 million monthly readers and a constantly updated library of tech-focused insights, <strong><a href=\"https://hackernoon.com/p/publish-with-us\">HackerNoon</a> is one of the best places to share your story with the world.</strong></p><ol start=\"2\"><li><strong>Collect Third-Party Validation Like Infinity Stones</strong></li></ol><p>Validation creates a flywheel: once one respected outlet, award, or community signals your value, others follow. Apply for awards. Enter contests. Even  recognitions are powerful credibility boosts. This is something we understand all too well. The latest edition of our Startups award,  recorded over 4.3 million votes to crown top startups in over 100 industries and regions.</p><p>One of our Startups of The Year, , took things a step further by partnering with HackerNoon to launch the inaugural  which has since then brought in hundreds of stories from writers who interacted with the company enough to write about it.</p><p>Influencer marketing Startups like  also demonstrate this principle well. They built traction by amplifying authentic creator voices across multiple networks, letting others validate them publicly. It’s a reminder that credibility spreads faster when it’s shared by communities, not just self-declared by founders.</p><ol start=\"3\"><li><strong>Be Loud About Every Milestone &amp; Expand Your Distribution</strong></li></ol><p>Some founders bury their best traction in pitch decks. Don’t. Every milestone—first 100 users, first paying customers, product launch, R&amp;D breakthroughs, everything—is a story worth telling. And you need to tell it everywhere you can.</p><p>Publish consistently, then repurpose for different audiences: turn an article into a video essay for YouTube, break it down into bite-sized posts for text-first platforms like X, or adapt it into visuals for Instagram and LinkedIn. The more formats you use, the further your story travels.</p><h2>Do it all with HackerNoon</h2><p>The Validation Gap is where most good startups stumble. That’s why we created a special <strong>Business Blogging package</strong> for startups, designed to help you share your story with a dedicated audience of technologists, investors, and builders who care.</p><ul><li><p>&nbsp;to your website (yes, including CTAs)</p></li><li><p>A personalized Tech Company News Page featuring your logo, intro, call-to-action, and socials. Take a look at the  company page for an idea of what to expect.</p></li><li><p>&nbsp;to make your story shine</p></li><li><p><strong>Multiple permanent placements</strong>&nbsp;on HackerNoon and social media promotions</p></li><li><p>Stories converted into&nbsp;&nbsp;and distributed via audio RSS feeds</p></li><li><p><strong>Your brand also gains domain authority and SEO</strong>&nbsp;via canonical links, and the story is distributed across 8 different relevant keyword/tagged pages for better organic discoverability.</p></li></ul><p>:::tip\n<strong>Ready to close the validation gap?</strong></p>","contentLength":5101,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A new a16z report looks at which AI companies startups are actually paying for","url":"https://techcrunch.com/2025/10/02/a-new-a16z-report-looks-at-which-ai-companies-startups-are-actually-paying-for/","date":1759417200,"author":"Dominic-Madori Davis","guid":190,"unread":true,"content":"<article>a16z releases its first AI spending report that shows which AI-native application layer companies startups are actually spending money on .</article>","contentLength":139,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Phoebe Gates and Sophia Kianni share the playbook for scaling consumer AI and winning Gen Z at TechCrunch Disrupt 2025","url":"https://techcrunch.com/2025/10/02/storming-the-gates-scaling-consumer-ai-with-phoebe-gates-and-sophia-kianni-only-at-techcrunch-disrupt-2025/","date":1759417200,"author":"TechCrunch Events","guid":191,"unread":true,"content":"<article>Phia co-founders Phoebe Gates and Sophia Kianni are redefining how Gen Z shops with AI. At TechCrunch Disrupt 2025, they’ll share how they’re scaling one of the year’s hottest startups into a lasting consumer brand. Register to join.</article>","contentLength":239,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Breaking Records and Redefining Innovation: The Billion-Dollar Rise of Jeremy Roma","url":"https://hackernoon.com/breaking-records-and-redefining-innovation-the-billion-dollar-rise-of-jeremy-roma?source=rss","date":1759417199,"author":"Jon Stojan Journalist","guid":306,"unread":true,"content":"<article>Jeremy Roma disrupted fintech with a decentralized crowdfunding platform that surpassed $1B in growth and empowered over 200,000 users, creating 100+ millionaires. He later launched a $200M-backed sports tech venture and overcame $1B in frozen assets with resilience. Now preparing a $10B project, Roma continues his mission to democratize wealth, empower communities, and redefine innovation.</article>","contentLength":393,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hackers are sending extortion emails to executives after claiming Oracle apps’ data breach","url":"https://techcrunch.com/2025/10/02/hackers-are-sending-extortion-emails-to-executives-after-claiming-oracle-apps-data-breach/","date":1759417027,"author":"Zack Whittaker","guid":189,"unread":true,"content":"<article>Google says hackers associated with the Clop ransomware gang are emailing executives at multiple organizations claiming to have stolen their personal information from a suite of Oracle E-Business apps.</article>","contentLength":201,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenAI is the world’s most valuable private company after private stock sale","url":"https://techcrunch.com/2025/10/02/openai-is-the-worlds-most-valuable-private-company-after-private-stock-sale/","date":1759415744,"author":"Russell Brandom","guid":188,"unread":true,"content":"<article>OpenAI employees sold $6.6B in shares, leading company's valuation to jump to $500B.  </article>","contentLength":86,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Apple shelves Vision Pro overhaul to focus on AI glasses","url":"https://techcrunch.com/2025/10/02/apple-shelves-vision-pro-overhaul-to-focus-on-ai-glasses/","date":1759413973,"author":"Aisha Malik","guid":187,"unread":true,"content":"<article>Bloomberg reports that the tech giant is developing at least two types of smart glasses. </article>","contentLength":89,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"11 Oddball Technology Records You Probably Didn’t Know","url":"https://spectrum.ieee.org/11-oddball-technology-records-you-probably-didnt-know","date":1759413604,"author":"Gwendolyn Rak","guid":127,"unread":true,"content":"<p>The strongest robotic arm, the fastest brain typist, and more</p>","contentLength":61,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTYwOTc2NS9vcmlnaW4ucG5nIiwiZXhwaXJlc19hdCI6MTc4MTg1Njk1MX0.XMfLMiK7LH7lJH87kY_P-JBC9Ut1KB7wXtUzKlYZonc/image.png?width=600","enclosureMime":"","commentsUrl":null},{"title":"Last chance alert: Founder and Investor Bundle savings for TechCrunch Disrupt 2025 ends tomorrow","url":"https://techcrunch.com/2025/10/02/last-chance-alert-founder-and-investor-bundle-savings-for-techcrunch-disrupt-2025-ends-tomorrow/","date":1759413600,"author":"TechCrunch Events","guid":186,"unread":true,"content":"<article>Founder and Investor Bundle savings for TechCrunch Disrupt 2025 end tomorrow, October 3. Groups of 4–9 founders save 15% and investors save 20%. Access top VCs, pitch-ready startups, and hands-on sessions. </article>","contentLength":208,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linux 6.18 Kbuild Brings An Optimization For gen_init_cpio On Btrfs Or XFS","url":"https://www.phoronix.com/news/Linux-6.18-Kbuild","date":1759411020,"author":"Michael Larabel","guid":726,"unread":true,"content":"<article>The Kbuild changes have been merged for the in-development Linux 6.18 kernel...</article>","contentLength":79,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Quest to Sequence the Genomes of Everything","url":"https://spectrum.ieee.org/whole-genome-sequencing","date":1759410004,"author":"Glenn Zorpette","guid":126,"unread":true,"content":"<p>The Earth BioGenome Project is a bioinformatics blockbuster</p>","contentLength":59,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTY5MjYzMS9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTgwMTY4ODMwOH0.aNR3X_0Tq_pceokATNUuPKppqKxIAIoEcmdn-y-u6kI/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"How We Built a Gaming Platform That Never Takes Your Money (But Still Makes Millions)","url":"https://hackernoon.com/how-we-built-a-gaming-platform-that-never-takes-your-money-but-still-makes-millions?source=rss","date":1759409999,"author":"Slotozilla","guid":305,"unread":true,"content":"<article>Slotozilla solved the paradox of building a casino-scale platform without real-money play. Hosting 40,000+ slots from 200+ providers, it handles hundreds of thousands of anonymous sessions daily. With custom aggregators, CDN strategies, and tournament systems, Slotozilla proves demo platforms can scale profitably through affiliate models and smart engineering.</article>","contentLength":362,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Second Beta Of KDE Plasma 6.5 Released For Testing","url":"https://www.phoronix.com/news/KDE-Plasma-6.5-Beta-2","date":1759409620,"author":"Michael Larabel","guid":725,"unread":true,"content":"<article>Following last month's release of the first KDE Plasma 6.5 Beta, a second beta milestone was released today ahead of the stable release coming later in October...</article>","contentLength":162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Posts Linux Driver Patches For Nova Lake Audio Support","url":"https://www.phoronix.com/news/Intel-Nova-Lake-Audio-Support","date":1759407385,"author":"Michael Larabel","guid":724,"unread":true,"content":"<article>So far Intel has posted very few Linux kernel driver enablement patches around Nova Lake but it looks like that is about to change...</article>","contentLength":133,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Raspberry Pi OS Updated Against Debian 13 Trixie","url":"https://www.phoronix.com/news/Raspberry-Pi-OS-Debian-13","date":1759406492,"author":"Michael Larabel","guid":723,"unread":true,"content":"<article>Following the recent Raspberry Pi 500+ launch, the latest Raspberry Pi news is the release of Raspberry Pi OS now re-based against Debian 13 \"Trixie\" along with some additional changes...</article>","contentLength":187,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why Gossiping to All Peers Might Be the Smartest Move for Small Networks","url":"https://hackernoon.com/why-gossiping-to-all-peers-might-be-the-smartest-move-for-small-networks?source=rss","date":1759404606,"author":"EScholar: Electronic Academic Papers for Scholars","guid":304,"unread":true,"content":"<h2>8. Extensions and optimizations</h2><p>To speed up synchronization process, node may send messages to all known peers. This solution make sense when:</p><ol><li><p>There are not so many nodes in the system (like 5-9)</p></li><li><p>The latency is predictable</p></li></ol><h3>8.2 Reducing Timestamp index</h3><p>In case the solution use synchronization primitives and there is a guarantee that there won’t be two or more records with the same timestamp, then timestampIndex may be reduced.</p><h3>8.3 bitmap map for public keys</h3><p>To reduce amount of traffic during replication, the algorithm uses bitmap as replacement for public keys. As all nodes should be aware of all public keys in network, it’s fair to say, that all nodes have the same set of public keys. The bitmap algorithm (for the certain record’s public key):</p><ol><li><p>All public keys are sorted in ASC order</p></li><li><p>Then algorithm iterate over sorted public keys: in case the public key is present in record then algorithm return 1 otherwise 0. Example: there are public keys in network [A, B, C, D], the record includes signatures and public keys for [B, C], then bitmap will look: 0110 in binary form, or 6 in decimal form</p></li><li><p>This number in decimal is then used instead of public keys during replication process</p></li><li><p>The decoding happens in the opposite way</p></li></ol><p>(1) Egor Zuev (zyev.egor@gmail.com)</p>","contentLength":1259,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Signed Programs & Other BPF Changes Merged For Linux 6.18","url":"https://www.phoronix.com/news/Linux--6.18-BPF","date":1759384800,"author":"Michael Larabel","guid":722,"unread":true,"content":"<article>The BPF changes have been merged for the in-development Linux 6.18 kernel...</article>","contentLength":76,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Steam On Linux Use Up 1% From Last September","url":"https://www.phoronix.com/news/Steam-September-2925","date":1759363817,"author":"Michael Larabel","guid":721,"unread":true,"content":"<article>Valve just published the Steam Survey results for September with a slight increase to the Linux gaming userbase...</article>","contentLength":114,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"TrueNAS 25.10-RC1 Brings Better Disk Import/Export, ZFS Rewrite Improvements","url":"https://www.phoronix.com/news/TrueNAS-25.10-RC1-Released","date":1759360191,"author":"Michael Larabel","guid":720,"unread":true,"content":"<article>TrueNAS 25.10-RC1 is out today as the newest test release of this OpenZFS+Linux-based operating system for network attached storage (NAS) hardware and other storage devices...</article>","contentLength":175,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Minor Optimization Comes For x86 Memory Management In Linux 6.18","url":"https://www.phoronix.com/news/Linux-6.18-x86-mm","date":1759358205,"author":"Michael Larabel","guid":719,"unread":true,"content":"<article>Sent out today was the x86/mm pull request of the x86/x86_64 memory management changes destined for this next version of the Linux kernel. This pull has just one new patch but is worth mentioning...</article>","contentLength":198,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"That annoying SMS phish you just got may have come from a box like this","url":"https://arstechnica.com/security/2025/10/that-annoying-sms-phish-you-just-got-may-have-come-from-a-box-like-this/","date":1759356967,"author":"Dan Goodin","guid":351,"unread":true,"content":"<p>Scammers have been abusing unsecured cellular routers used in industrial settings to blast SMS-based phishing messages in campaigns that have been ongoing since 2023, researchers said.</p><p>The routers, manufactured by China-based Milesight IoT Co., Ltd., are rugged Internet of Things devices that use cellular networks to connect traffic lights, electric power meters, and other sorts of remote industrial devices to central hubs. They come equipped with SIM cards that work with 3G/4G/5G cellular networks and can be controlled by text message, Python scripts, and web interfaces.</p><h2>An unsophisticated, yet effective, delivery vector</h2><p>Security company Sekoia on Tuesday <a href=\"https://blog.sekoia.io/silent-smishing-the-hidden-abuse-of-cellular-router-apis/\">said</a> that an analysis of “suspicious network traces” detected in its honeypots led to the discovery of a cellular router being abused to send SMS messages with phishing URLs. As company researchers investigated further, they identified more than 18,000 such routers accessible on the Internet, with at least 572 of them allowing free access to programming interfaces to anyone who took the time to look for them. The vast majority of the routers were running firmware versions that were more than three years out of date and had known vulnerabilities.</p>","contentLength":1217,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/10/UR35-800x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"Attack Vector Controls Can Now Manage VMSCAPE Mitigation","url":"https://www.phoronix.com/news/Linux-6.18-AVC-VMSCAPE","date":1759351899,"author":"Michael Larabel","guid":718,"unread":true,"content":"<article>Made public and mitigated within the mainline Linux kernel last month was the VMSCAPE vulnerability affecting both AMD and Intel CPUs. Now merged for the in-development Linux 6.18 kernel is adding VMSCAPE to the recently-introduced Attack Vector Controls functionality...</article>","contentLength":271,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Fire Emblem Shadows Review - Emergency Meeting","url":"https://www.gamespot.com/reviews/fire-emblem-shadows-review-emergency-meeting/1900-6418418/?ftag=CAD-01-10abi2f","date":1759344600,"author":"Cameron Koch","guid":685,"unread":true,"content":"<p>The release of a new Fire Emblem game is usually a big deal, so I was more than a little intrigued--but mostly confused--when I happened to glance at the Nintendo Today app calendar on September 24 and it said \"Fire Emblem Shadows Available.\" There had just been a <a href=\"https://www.gamespot.com/gallery/nintendo-direct-september-2025-all-the-biggest-announcements/2900-7026/\">Nintendo Direct on September 12</a>, after all, where Nintendo announced the next mainline entry in the series for Switch 2, <a href=\"https://www.gamespot.com/articles/fire-emblem-fortunes-weave-coming-to-switch-2-in-2026/1100-6534686/\">Fire Emblem: Fortune's Weave</a>. There was no mention of Fire Emblem Shadows. And after playing it, I can see why Nintendo wouldn't showcase it on that big stage</p><p dir=\"ltr\">I assumed it was referring to Fire Emblem: Shadow Dragon, the 2009 remake of the first game in the series, and went on with my day. It was only later that evening I learned that Fire Emblem Shadows was actually a brand-new mobile entry in the series: one where players manage \"real-time strategy and social deduction at the same time.\"</p><p dir=\"ltr\">The idea of a new game in the long-running tactics series arriving out of the blue had me eager to install it and see what it was about. I had a decent time with Fire Emblem Heroes, Nintendo's previous attempt at translating Fire Emblem to the world of free-to-play mobile games (and one that would go on to become <a href=\"https://www.gamespot.com/articles/fire-emblem-heroes-is-nintendos-first-mobile-game-to-hit-1-billion-in-revenue/1100-6505005/\">Nintendo's first mobile game to hit $1 billion in revenue</a>). As such, I was curious to see how Shadows, which is also free to play, would differ. Unfortunately, the monkey paw soon curled, and I found myself dumbfounded by all the ways Fire Emblem Shadows is Fire Emblem in name only.</p><a href=\"https://www.gamespot.com/reviews/fire-emblem-shadows-review-emergency-meeting/1900-6418418/?ftag=CAD-01-10abi2f/\">Continue Reading at GameSpot</a>","contentLength":1505,"flags":null,"enclosureUrl":"https://www.gamespot.com/a/uploads/screen_medium/43/434805/4578401-1811854570-fire-.jpg","enclosureMime":"","commentsUrl":null},{"title":"OpenAI’s Sora 2 lets users insert themselves into AI videos with sound","url":"https://arstechnica.com/ai/2025/10/openais-sora-2-lets-users-insert-themselves-into-ai-videos-with-sound/","date":1759343820,"author":"Benj Edwards","guid":350,"unread":true,"content":"<p>On Tuesday, OpenAI <a href=\"https://openai.com/index/sora-2/\">announced</a> Sora 2, its second-generation video-synthesis AI model that can now generate videos in various styles with synchronized dialogue and sound effects, which is a first for the company. OpenAI also launched a new iOS social app that allows users to insert themselves into AI-generated videos through what OpenAI calls \"cameos.\"</p><p>OpenAI showcased the new model in an AI-generated video that features a photorealistic version of OpenAI CEO Sam Altman talking to the camera in a slightly unnatural-sounding voice amid fantastical backdrops, like a competitive ride-on duck race and a glowing mushroom garden.</p><p>Regarding that voice, the new model can create what OpenAI calls \"sophisticated background soundscapes, speech, and sound effects with a high degree of realism.\" In May, Google's <a href=\"https://arstechnica.com/ai/2025/05/ai-video-just-took-a-startling-leap-in-realism-are-we-doomed/\">Veo 3</a> became the first video-synthesis model from a major AI lab to generate synchronized audio as well as video. Just a few days ago, Alibaba released <a href=\"https://wan25.net/\">Wan 2.5</a>, an open-weights video model that can generate audio as well. Now OpenAI has joined the audio party with Sora 2.</p>","contentLength":1079,"flags":null,"enclosureUrl":"https://cdn.arstechnica.net/wp-content/uploads/2025/10/fake_altman-1152x648.jpg","enclosureMime":"","commentsUrl":null},{"title":"More ASUS Motherboards Will Have Working Sensor Monitoring With Linux 6.18","url":"https://www.phoronix.com/news/Linux-6.18-HWMON","date":1759341600,"author":"Michael Larabel","guid":717,"unread":true,"content":"<article>The hardware monitoring \"HWMON\" subsystem updates have been sent out for the Linux 6.18 kernel with some notable additions...</article>","contentLength":125,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Intel Arc Pro B50, Raspberry Pi 500+, Strix Halo & Other September Highlights","url":"https://www.phoronix.com/news/September-2025","date":1759338000,"author":"Michael Larabel","guid":716,"unread":true,"content":"<article>During the month of September on Phoronix were 271 original Linux/open-source news articles and another 19 featured Linux hardware reviews and benchmark articles, all written by your's truly. Here is a look back at what excited Linux enthusiasts the most on Phoronix during September...</article>","contentLength":286,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Muscle-Bound Micromirrors Could Bring Lidar to More Cars","url":"https://spectrum.ieee.org/mems-lidar","date":1759330803,"author":"Perri Thaler","guid":125,"unread":true,"content":"<p>And cut data center power use, too</p>","contentLength":34,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTY4MDUwNC9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc2NzUyNjEyOX0.ap9_W6cYJ8jR2TGjQdZYYXoY7_qBooqH_mjhl4Nmnkk/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"EXT4, EROFS & NTFS3 File-System Drivers Ready With Improvements For Linux 6.18","url":"https://www.phoronix.com/news/Linux-6.18-EXT4-EROFS-NTFS3","date":1759330287,"author":"Michael Larabel","guid":715,"unread":true,"content":"<article>In addition to XFS enabling online fsck by default, Bcachefs being stripped from the mainline Linux kernel, and Btrfs improvements making for a notable first few days of the Linux 6.18 window, there's more. The EXT4, EROFS, and NTFS3 drivers are bringing the latest batch of file-system changes for Linux 6.18...</article>","contentLength":312,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI Expands the Search for New Battery Materials","url":"https://spectrum.ieee.org/ai-battery-material","date":1759327204,"author":"Andrew Moseman","guid":124,"unread":true,"content":"<p>Microsoft and IBM pinpoint candidates from millions of options</p>","contentLength":62,"flags":null,"enclosureUrl":"https://spectrum.ieee.org/media-library/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy82MTY2ODAwMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc3NjAyNzQ3Mn0.d89fN4NCmdXR1JYEYplsjb-hQHasebXBlzT2TH1-3yU/image.jpg?width=600","enclosureMime":"","commentsUrl":null},{"title":"The Hidden Behemoth Behind Every AI Answer","url":"https://spectrum.ieee.org/ai-energy-use","date":1759323603,"author":"Matthew S. Smith","guid":123,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"openSUSE Leap 16 Released - Requires x86-64-v2 CPUs, No x86 32-bit Support By Default","url":"https://www.phoronix.com/news/openSUSE-Leap-16","date":1759322622,"author":"Michael Larabel","guid":714,"unread":true,"content":"<article>OpenSUSE Leap 16.0 is out today as this community Linux distributiom built from the same sources as SUSE Linux Enterprise 16...</article>","contentLength":127,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linus Torvalds Lashes Out At RISC-V Big Endian Plans","url":"https://www.phoronix.com/news/Torvalds-No-RISC-V-BE","date":1759321269,"author":"Michael Larabel","guid":713,"unread":true,"content":"<article>Linus Torvalds has come out strong against proposed support for RISC-V big endian capabilities within the Linux kernel...</article>","contentLength":121,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Academy Software Foundation's OpenColorIO Adds Vulkan Support","url":"https://www.phoronix.com/news/OpenColorIO-Adds-Vulkan","date":1759320715,"author":"Michael Larabel","guid":712,"unread":true,"content":"<article>The Academy Software Foundation's OpenColorIO \"OCIO\" project as a color management solution for motion picture production and related uses has added support for the Vulkan API...</article>","contentLength":178,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mesa PowerVR Driver Lands Changes For Vulkan 1.2 Support","url":"https://www.phoronix.com/news/Mesa-PowerVR-Vulkan-1.2","date":1759320393,"author":"Michael Larabel","guid":711,"unread":true,"content":"<article>Changes merged this week to the Mesa PowerVR Vulkan driver now allow it to support all of the functionality required by the Vulkan 1.2 specification...</article>","contentLength":151,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"OpenZFS 2.4-rc2 Released With Linux 6.17 Support, Bug Fixes","url":"https://www.phoronix.com/news/OpenZFS-2.4-rc2","date":1759320033,"author":"Michael Larabel","guid":710,"unread":true,"content":"<article>OpenZFS 2.4-rc2 was released on Tuesday as the latest stepping stone toward the big OpenZFS 2.4 feature release...</article>","contentLength":114,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Raspberry Pi Announces Price Increases Due To Rising Memory Demand","url":"https://www.phoronix.com/news/Raspberry-Pi-Price-RAM-Demand","date":1759319059,"author":"Michael Larabel","guid":709,"unread":true,"content":"<article>Due to rising demand around system memory being pushed up in large part by HBM for AI applications, Raspberry Pi announced price increases on select products to help offset the rising LPDDR costs...</article>","contentLength":198,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["tech"]}