{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Manchester police name synagogue attacker as two men confirmed dead","url":"https://www.bbc.com/news/live/cx2703lnww4t","date":1759439569,"author":"/u/fanastril","guid":662,"unread":true,"content":"<p>The Jewish festival of Yom Kippur has finished. </p><p>As British Jews across the UK attended synagogue this morning for the holiest day in the Jewish calendar, many found out that there had been an attack outside a synagogue in Manchester. </p><p>The horror filtered across the synagogue in whispers. </p><p>It is a day of fasting, reflection and prayer, when Jewish people believe it is the day that sets how their year will go. </p><p>The words used in one of the most significant prayers on this day: “on Yom Kippur it is sealed... who will live and who will die”. </p><p>Today, terror came to British Jews at their synagogue, and many absolutely fear for their safety. Security is already mandatory for synagogues, Jewish schools and community centres, but it is unable to fully keep out the hate.</p><p>Jewish people greet each other on Yom Kippur with a phrase in Hebrew \"G’mar Chatima Tovah\". It’s interpreted as \"may you have a good and final sealing in the book of life\".</p><p>Two Jewish people in Britain lost their lives today and for the community here, some who over generations fled persecution to these shores, who always viewed Britain as a safe haven, but have been rocked by an increase in antisemitism, nothing will ever feel the same again.</p>","contentLength":1221,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nwg8g2/manchester_police_name_synagogue_attacker_as_two/"},{"title":"Former German chancellor Angela Merkel gave an interview to the most popular political hungarian youtube channel, Partizán. The Partizán is by far the most influential opposition media group in Hungary, so much so that without them Péter Magyar wouldn't have become Orbán's challenger","url":"https://www.reddit.com/r/europe/comments/1nwcipi/former_german_chancellor_angela_merkel_gave_an/","date":1759431314,"author":"/u/esztelenfasztalan","guid":664,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"43 European Leaders attending the 7th European Political Community Summit in Copenhagen","url":"https://www.reddit.com/r/europe/comments/1nw67vq/43_european_leaders_attending_the_7th_european/","date":1759417338,"author":"/u/xMusa24","guid":665,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"\"Police say Manchester synagogue attack in which two died has been declared terrorist incident\"","url":"https://www.bbc.co.uk/news/live/cx2703lnww4t","date":1759415315,"author":"/u/Sorryyoudisagree","guid":661,"unread":true,"content":"<p>The Jewish festival of Yom Kippur has finished. </p><p>As British Jews across the UK attended synagogue this morning for the holiest day in the Jewish calendar, many found out that there had been an attack outside a synagogue in Manchester. </p><p>The horror filtered across the synagogue in whispers. </p><p>It is a day of fasting, reflection and prayer, when Jewish people believe it is the day that sets how their year will go. </p><p>The words used in one of the most significant prayers on this day: “on Yom Kippur it is sealed... who will live and who will die”. </p><p>Today, terror came to British Jews at their synagogue, and many absolutely fear for their safety. Security is already mandatory for synagogues, Jewish schools and community centres, but it is unable to fully keep out the hate.</p><p>Jewish people greet each other on Yom Kippur with a phrase in Hebrew \"G’mar Chatima Tovah\". It’s interpreted as \"may you have a good and final sealing in the book of life\".</p><p>Two Jewish people in Britain lost their lives today and for the community here, some who over generations fled persecution to these shores, who always viewed Britain as a safe haven, but have been rocked by an increase in antisemitism, nothing will ever feel the same again.</p>","contentLength":1221,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nw5bwn/police_say_manchester_synagogue_attack_in_which/"},{"title":"Chat Control: Signal app boss threatens to withdraw from Europe","url":"https://www.bluewin.ch/en/news/signal-app-boss-threatens-to-withdraw-from-europe-2897197.html","date":1759412863,"author":"/u/New-Ranger-8960","guid":666,"unread":true,"content":"<p data-t-name=\"Paragraph\">The head of the Signal app has criticized plans in the EU that would allow messengers to have backdoors to enable automatic searches for criminal content. Signal is considered one of the most secure messengers.</p><p data-t-name=\"Paragraph\">\"If we were faced with the choice of either undermining the integrity of our encryption and our data protection guarantees or leaving Europe, we would unfortunately make the decision to leave the market,\" Meredith Whittaker told the German Press Agency (dpa). The data protection expert is President of the non-profit Signal Foundation in the USA, which develops Signal.</p><p data-t-name=\"Paragraph\">The European Union has been discussing a law for three years that is intended to regulate the fight against depictions of child sexual abuse. The proposal for a corresponding regulation stipulates that messengers such as WhatsApp, Signal, Telegram and Threema should allow content to be checked before it is encrypted. To this end, the apps would have to include a control mechanism that can check all content.</p><h2>\"Not only the good guys have access to a backdoor\"</h2><p data-t-name=\"Paragraph\">Whittaker said Signal would never undermine the integrity of its end-to-end encryption. \"It guarantees the privacy of millions and millions of people around the world, often in life-threatening situations.\" This is why Signal rejects chat control. \"It's unfortunate that politicians continue to fall prey to a kind of magical thinking that assumes you can create a backdoor that only the good guys can access.\"</p><p data-t-name=\"Paragraph\">In the debate on chat control in the EU, the European Parliament had opposed such plans - with a broad majority across all political camps. In the Council of Member States, on the other hand, there was a majority in favor of chat control. However, without Germany and a few other countries, the plans could not be implemented here either. This could now change under the Danish Council Presidency.</p><h2>Unclear position of the German government</h2><p data-t-name=\"Paragraph\">It will be important to see how Germany positions itself. The coalition agreement of the black-red federal government states: \"We will combat discrimination in the digital space and protect fundamental digital rights. In principle, we will safeguard the confidentiality of private communication and anonymity online.\" However, the word \"in principle\" indicates that exceptions to this principle may be permitted. Critics fear that this will also make it possible to install backdoors in WhatsApp, Signal and co.</p><p data-t-name=\"Paragraph\">Signal CEO Whittaker said that in the worst case scenario, they would work with partners and the community to see if they could find ways to circumvent these rules. Signal also did this when the app was blocked in Russia or Iran. \"But ultimately, we would leave the market before we had to comply with dangerous laws like these.\"</p><h2>Warning about the AI agents</h2><p data-t-name=\"Paragraph\">In the interview with dpa, Whittaker also warned against the use of so-called AI agents, i.e. software robots with artificial intelligence that travel the internet on behalf of the user and independently take care of things such as booking a table in a restaurant or coordinating appointments with friends. \"These AI agents require enormous access options and almost unlimited authorizations. This gives them access to important applications and services - from the calendar to the email account, the Signal app or the credit card.\"</p><p data-t-name=\"Paragraph\">In order for apps such as Signal to be able to effectively defend themselves against spying, the manufacturers of the operating systems for computers and cell phones - i.e. Microsoft with Windows, Google with Android and Apple especially with iOS for the iPhone - now have a duty. They would have to set up an objection option against AI agents at developer level.</p>","contentLength":3651,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nw49on/chat_control_signal_app_boss_threatens_to/"},{"title":"Russia Upgraded Missiles to Bypass Patriot. Ukraine Intercepts Only 6% of Ballistic Targets","url":"https://sfg.media/en/a/russia-upgraded-missiles-patriot/","date":1759403731,"author":"/u/sergeyfomkin","guid":667,"unread":true,"content":"<div>\n\t\t\tRussia, <a href=\"https://www.ft.com/content/078b8e70-a58c-47cc-b573-598850dd5685\" target=\"_blank\">according to</a> the , may have upgraded its ballistic missiles used in strikes on Ukraine so they can evade the Patriot air defense system. The paper cites Ukrainian and Western sources.\n\t\t</div><div>\n\t\t\tThe systems in question are the Iskander-M short-range ballistic missile, with a declared range of up to 500 kilometers, and the Kinzhal aero-ballistic missile, capable of hitting targets up to 480 kilometers away.\n\t\t</div><div>\n\t\t\tAccording to FT’s sources, the missiles initially follow a standard trajectory before abruptly veering off course, executing a steep dive or a series of maneuvers that make interception by Patriot defenses more difficult.\n\t\t</div><div>\n\t\t\tThe effectiveness of Ukraine’s air defenses has dropped sharply: while in August 37% of Russian ballistic missiles were intercepted, in September the figure fell to just 6%.\n\t\t</div><div>\n\t\t\tThe paper notes that in the summer of 2025 Russia struck at least four drone-production facilities in Kyiv and the surrounding region. Among the targets was a plant manufacturing Turkish Bayraktar drones. That strike, carried out on August 28, saw Russian missiles bypass Ukraine’s air defenses and also damage the buildings of the EU delegation and the British Council located nearby.\n\t\t</div>","contentLength":1225,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nw0xjp/russia_upgraded_missiles_to_bypass_patriot/"},{"title":"Chinese state-owned company revealed as owner of three data cables in the Baltic Sea, can access data","url":"https://www.hs.fi/tutkiva/art-2000011509873.html","date":1759401163,"author":"/u/teftelis07","guid":663,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nw05pv/chinese_stateowned_company_revealed_as_owner_of/"},{"title":"Brexit was a disaster – now UK PM Starmer dares to admit it","url":"https://inews.co.uk/opinion/brexit-disaster-now-starmer-dares-admit-it-3950827","date":1759398022,"author":"/u/ByGollie","guid":669,"unread":true,"content":"<p>If someone does something once, it might be an accident. If they do it twice, it suggests a habit. But if they do it three times, it’s a communication strategy.</p><p>Keir Starmer said something rather noticeable <a href=\"https://inews.co.uk/opinion/starmers-speech-merciless-time-reform-feel-afraid-again-3947606?ico=in-line_link\">in his conference speech</a>. He mocked the politicians who’d told voters that “Brexit lies on the side of that bus, click here for your new country”. That made the ears prick up. It’s the first time in a very long time that the Prime Minister has spoken critically about Brexit.</p><p>You know he opposes it. He’s a human rights lawyer from north London. But he is usually too straitjacketed by Labour’s electoral strategy to say so publicly. Perhaps it was an accident, then. A slip of the tongue. Perhaps he let his feelings out by mistake and would keep them better concealed in future. </p><p>Then, moments later, he did it again. The “self-appointed champions of working people”, he said, “lied to this country, unleashed chaos and walked away after Brexit”.</p><p>Oh. So it wasn’t an accident. It was a habit. Then in an interview with GB News – of all people – he went even further. When we were in the EU, Britain had a returns agreement with the European Union on asylum, he pointed out. Farage “told the country it will make no difference if we left – well, he was wrong about that”. The small boats were therefore “Farage Boats”.</p><p>That makes it a communication strategy. You don’t do the same thing three times in 24 hours by accident. And that suggests something profound: that <a href=\"https://inews.co.uk/opinion/brexit-cheerleaders-have-gone-awfully-quiet-so-let-me-remind-you-what-they-did-to-britain-3512504?ico=in-line_link\">the view of Brexit as a failure is now settled</a>. It has ossified into a national consensus, without us ever really realising it was happening. Even the Labour leadership, which is usually petrified of this issue, believes it can safely criticise it.</p><p>During the <a href=\"https://inews.co.uk/opinion/cant-argue-brexiters-lost-capacity-for-reason-3704274?ico=in-line_link\">Brexit wars</a>, Remainers would ask themselves when people would realise it was a mistake. The moment stubbornly refused to arrive. The value of sterling collapsed. The EU comprehensively out-negotiated us. Our political system fell into chaos. Small businesses went bust. None of it seemed to move the dial.</p><p>The truth is, people are terrible at owning up to their mistakes. They very rarely admit that they were wrong about something. Instead, they turn into mini-Stalins, expunging their historical record and replacing it with one in which they were always right. People have very poor memories, especially when it comes to their own errors.</p><p>Take the Iraq War. Nowadays, everyone seems to have been against it. They always knew it would be a disaster. They’d always thought so.</p><p>But this is not how it felt at the time. <a href=\"https://www.theguardian.com/media/2003/mar/17/mondaymediasection.Iraqandthemedia\" target=\"_blank\" rel=\"noreferrer noopener\">Back then</a>, there was broad and animated support for the war. , , , ,  and all supported it. With a combined circulation of 9.4 million, they massively outweighed the three papers opposing the war – the , and  – which had a combined audience of 2.7 million.</p><p>YouGov conducted <a target=\"_blank\" href=\"https://yougov.co.uk/politics/articles/45444-iraq-war-20-years-later-what-do-britons-think-abou\" rel=\"noreferrer noopener\">21 polls</a> between March and December 2003, asking whether people supported the war. On average, 54 per cent of Brits thought it was right. Now, that figure has plummeted, with just 23 per cent of people thinking it was right.</p><p>Fine, so people changed their minds. Well, not quite. That would have involved a degree of honest introspection most people are incapable of. Instead, they simply rearranged the past so that it reflected their newfound view.</p><p>When YouGov <a target=\"_blank\" href=\"https://yougov.co.uk/politics/articles/12483-remembering-iraq\" rel=\"noreferrer noopener\">asked people in 2015</a> what their opinions of war in Iraq were at the time, just 37 per cent said they supported military action, an astonishing drop from the figures at the time. The effect is even more dramatic <a target=\"_blank\" href=\"https://today.yougov.com/politics/articles/12386-americans-remember-opposing-2003-war-iraq\" rel=\"noreferrer noopener\">in the US</a>. At the time of the war, 63 per cent of people backed the invasion. But a few years later, just 38 per cent recalled doing so.</p><p>Slowly but surely, the same thing seems to be happening with Brexit. There was no one central event, no great moment of epiphany in which the nation realised what an error the whole thing was. But slowly, like rising damp, a sense of disdain, mockery and disappointment has taken over. A settled view has developed, without drama or surprise, without anyone even really noticing that it’s happening.</p><p>Who on earth could claim that Brexit has been a success? Who could name a single benefit it has provided? Who could look at the promises made before the referendum and treat them with anything but bitter laughter now we know how it turned out?</p><p>People will find different ways of framing their box-fresh opposition. They’ll say politicians missed the opportunities, or we had bad leadership, or the EU sabotaged us. But the truth is, it was a failure because it was a bad idea. It’s no more complicated than that. Voters were convinced to support a project to give the political class a kicking. In fact, they simply damaged themselves and their livelihoods.</p><p>None of that really matters anymore. What matters is that an anti-Brexit consensus helps us repair the damage.</p><p>Labour is not about to commit to rejoining the EU. Of course not. But it is pursuing a plan for a really quite intimate relationship with it: regulatory alignment in many areas, deep co-operation on defence, and now the Chancellor is confidently promoting an extensive youth mobility scheme – something which the party was reticent about supporting just a few months ago.</p><p>That’ll do for now. But as the consensus grows and Labour becomes more confident in criticising Brexit, the possibilities grow for the kinds of things we can demand in a few years’ time, perhaps in time for the next election. Single market membership, perhaps, or the customs union, or a bespoke arrangement like Switzerland has. Or perhaps even full-blown membership.</p><p>Brexit was always a terrible mistake. But now, at least, people recognise it. And with that, things might just start to improve.</p>","contentLength":5715,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nvzak1/brexit_was_a_disaster_now_uk_pm_starmer_dares_to/"},{"title":"Dutch F-35 shoots down Russian drone, displays kill marking","url":"https://ukdefencejournal.org.uk/dutch-f-35-shoots-down-russian-drone-displays-kill-marking/","date":1759394227,"author":"/u/MGC91","guid":670,"unread":true,"content":"<h4>A Royal Netherlands Air Force (RNLAF) F-35A has received a drone kill marking after shooting down a Russian drone during the September 9–10 incursion into Polish airspace.</h4><p>The incident, which saw around 23 drones cross from Belarus into Poland, triggered a NATO-wide Quick Reaction Alert and was described by Polish leaders as an “unprecedented case of an attack” on NATO territory.</p><p>The engagement was carried out by an F-35A of the 313th Squadron, deployed to Poland as part of NATO’s enhanced air policing mission. The Dutch Ministry of Defence later released an image showing a white drone silhouette painted below the canopy rail of the aircraft, marking the first confirmed combat kill for a Dutch Lightning II.</p><p>According to Polish officials, the drones entered Poland around 23:30 local time on 9 September, forcing the closure of Warsaw International, Warsaw Modlin, Rzeszów–Jasionka and Lublin airports. At least four drones were shot down, most by Dutch fighters. Analysts later identified several of the drones as Gerbera-type decoys, apparently designed to test allied defences and disrupt civil aviation.</p><p>Defence Minister Ruben Brekelmans, who visited the Dutch F-35 detachment in Poland days after the incident, praised the professionalism and teamwork involved. “Russia’s reckless aggression continues,” he said. “By stationing F-35s in Poland, the Netherlands is demonstrating its readiness with allies, because NATO’s eastern border is also our security border.” He highlighted not only the role of the pilots, but also the mechanics and ground crews, who ensured the jets were combat-ready.</p><p>The deployment of Dutch F-35s to Poland began on 1 September and will run until December, with the aircraft tasked to protect NATO airspace and deter further Russian incursions. From December, the Netherlands will also reinforce the mission with Patriot surface-to-air missiles, NASAMS, and counter-drone systems, bolstering Poland’s role as a logistics hub for support to Ukraine.</p><p>The September drone incursion marked one of the largest airspace violations by Russia since the start of its invasion of Ukraine. Poland invoked Article 4 of the NATO treaty in response, warning allies that Russian and Belarusian military activity represented an escalating threat. In the days after the incident, Russia and Belarus staged large-scale joint exercises, while NATO launched Operation Eastern Sentry to strengthen its air defences across the eastern flank.</p><p>For the Royal Netherlands Air Force, the kill marking underscores both the combat credibility of the F-35 and the country’s willingness to take an active role in Europe’s collective defence. The F-35A, with its advanced sensor fusion and stealth, is optimised for detecting and engaging drones that might evade older radar systems. Dutch officials stressed that its deployment has already proven vital in securing NATO’s skies against Russian provocations.</p>","contentLength":2941,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nvyb30/dutch_f35_shoots_down_russian_drone_displays_kill/"},{"title":"Belgian Prime Minister De Wever: \"I am willing to use the frozen Russian assets (€185b frozen in Belgium), but I need legal certainty and solidarity from other EU Member States to share the risks involved\".","url":"https://www.vrt.be/vrtnws/nl/liveblog/premier-de-wever-over-bevroren-russisch-geld-we-zijn-bereid-om~1758694365422/","date":1759393592,"author":"/u/BelgianPolitics","guid":668,"unread":true,"content":"<p>\"Het was een heel zware nacht in Kiev\", zegt Vlaming Barend Leyts, in het verleden nog journalist en woordvoerder van premier De Croo, die momenteel in de Oekraïense hoofdstad is als vrijwilliger voor een hulporganisatie. Hij merkt dat de luchtaanvallen echt wel zijn opgedreven, ook in het westen van het land.</p><p>\"Steeds meer komen mensen zeggen dat ze er genoeg van hebben en dat er moet worden onderhandeld. Maar tegelijk wil men niet onderhandelen tegen eender welke prijs. Mensen zijn de oorlog moe.\"</p><p>En dat is net de bedoeling van die onophoudelijke luchtaanvallen, zegt Leyts. \"Ze willen de vastberadenheid van de mensen breken en zorgen dat hun moreel erop achteruit gaat. Als je een hele nacht niet deftig hebt geslapen, ga je makkelijker toegevingen doen. Dat is die hele psychologische oorlogsvoering.\"</p><p>Op steun uit de VS rekenen de Oekraïners eigenlijk niet meer. Zeker niet nadat Poetin door Trump royaal werd ontvangen in Alaska. \"Een oorlogsmisdadiger in hun ogen die met zoveel egards wordt ontvangen, dat is heel slecht aangekomen. Sindsdien is het geloof enorm gezakt dat Trump een vredesduif kan zijn.\"</p>","contentLength":1118,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1nvy561/belgian_prime_minister_de_wever_i_am_willing_to/"}],"tags":["news","reddit"]}