{"id":"9aZ76XKBXChuWTyiMHuWa6","title":"Exploits & Vulns","displayTitle":"Exploits & Vulns","url":"","feedLink":"","isQuery":true,"isEmpty":false,"isHidden":false,"itemCount":43,"items":[{"title":"CVE-2025-65946 - Roo Code is Vulnerable to Potential Remote Code Execution via zsh Command Validation Bug","url":"https://cvefeed.io/vuln/detail/CVE-2025-65946","date":1763766945,"author":"","guid":6127,"unread":true,"content":"<article>CVE-2025-65946\n Nov. 21, 2025, 11:15 p.m. | 2&nbsp;hours, 22&nbsp;minutes ago\nRoo Code is an AI-powered autonomous coding agent that lives in users' editors. Prior to version 3.26.7, Due to an error in validation it was possible for Roo to automatically execute commands that did not match the allow list prefixes. This issue has been patched in version 3.26.7.\n 8.1 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":463,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-65947 - thread-amount is Vulnerable to Resource Exhaustion (Memory and Handle Leaks) on Windows and macOS","url":"https://cvefeed.io/vuln/detail/CVE-2025-65947","date":1763766945,"author":"","guid":6128,"unread":true,"content":"<article>CVE-2025-65947\n Nov. 21, 2025, 11:15 p.m. | 2&nbsp;hours, 22&nbsp;minutes ago\nthread-amount is a tool that gets the amount of threads in the current process. Prior to version 0.2.2, there are resource leaks when querying thread counts on Windows and Apple platforms. In Windows platforms, the thread_amount function calls CreateToolhelp32Snapshot but fails to close the returned HANDLE using CloseHandle. Repeated calls to this function will cause the handle count of the process to grow indefinitely, eventually leading to system instability or process termination when the handle limit is reached. In Apple platforms, the thread_amount function calls task_threads (via Mach kernel APIs) which allocates memory for the thread list. The function fails to deallocate this memory using vm_deallocate. Repeated calls will result in a steady memory leak, eventually causing the process to be killed by the OOM (Out of Memory) killer. This issue has been patched in version 0.2.2.\n 8.7 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":1077,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-65108 - md-to-pdf is vulnerable to arbitrary JavaScript code execution when parsing front matter","url":"https://cvefeed.io/vuln/detail/CVE-2025-65108","date":1763763393,"author":"","guid":6125,"unread":true,"content":"<article>CVE-2025-65108\n Nov. 21, 2025, 10:16 p.m. | 3&nbsp;hours, 21&nbsp;minutes ago\nmd-to-pdf is a CLI tool for converting Markdown files to PDF using Node.js and headless Chrome. Prior to version 5.2.5, a Markdown front-matter block that contains JavaScript delimiter causes the JS engine in gray-matter library to execute arbitrary code in the Markdown to PDF converter process of md-to-pdf library, resulting in remote code execution. This issue has been patched in version 5.2.5.\n 10.0 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":584,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-65109 - Minder does not sandbox http.send in Rego programs","url":"https://cvefeed.io/vuln/detail/CVE-2025-65109","date":1763763393,"author":"","guid":6126,"unread":true,"content":"<article>CVE-2025-65109\n Nov. 21, 2025, 10:16 p.m. | 3&nbsp;hours, 21&nbsp;minutes ago\nMinder is an open source software supply chain security platform. In Minder Helm version 0.20241106.3386+ref.2507dbf and Minder Go versions from 0.0.72 to 0.0.83, Minder users may fetch content in the context of the Minder server, which may include URLs which the user would not normally have access to. This issue has been patched in Minder Helm version 0.20250203.3849+ref.fdc94f0 and Minder Go version 0.0.84.\n 8.5 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":592,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-65102 - PJSIP is vulnerable to buffer overflow in Opus PLC","url":"https://cvefeed.io/vuln/detail/CVE-2025-65102","date":1763763392,"author":"","guid":6123,"unread":true,"content":"<article>CVE-2025-65102\n Nov. 21, 2025, 10:16 p.m. | 3&nbsp;hours, 21&nbsp;minutes ago\nPJSIP is a free and open source multimedia communication library. Prior to version 2.16, Opus PLC may zero-fill the input frame as long as the decoder ptime, while the input frame length, which is based on stream ptime, may be less than that. This issue affects PJSIP users who use the Opus audio codec in receiving direction. The vulnerability can lead to unexpected application termination due to a memory overwrite. This issue has been patched in version 2.16.\n 8.7 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":643,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-65106 - LangChain Vulnerable to Template Injection via Attribute Access in Prompt Templates","url":"https://cvefeed.io/vuln/detail/CVE-2025-65106","date":1763763392,"author":"","guid":6124,"unread":true,"content":"<article>CVE-2025-65106\n Nov. 21, 2025, 10:16 p.m. | 3&nbsp;hours, 21&nbsp;minutes ago\nLangChain is a framework for building agents and LLM-powered applications. From versions 0.3.79 and prior and 1.0.0 to 1.0.6, a template injection vulnerability exists in LangChain's prompt template system that allows attackers to access Python object internals through template syntax. This vulnerability affects applications that accept untrusted template strings (not just template variables) in ChatPromptTemplate and related prompt template classes. This issue has been patched in versions 0.3.80 and 1.0.7.\n 8.3 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":692,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-11087 - Zegen Core <= 2.0.1 - Cross-Site Request Forgery to Arbitrary File Upload","url":"https://cvefeed.io/vuln/detail/CVE-2025-11087","date":1763759750,"author":"","guid":6115,"unread":true,"content":"<article>CVE-2025-11087\n Nov. 21, 2025, 9:15 p.m. | 4&nbsp;hours, 22&nbsp;minutes ago\nThe Zegen Core plugin for WordPress is vulnerable to Cross-Site Request Forgery to Arbitrary File Upload in versions up to, and including, 2.0.1. This is due to missing nonce validation and missing file type validation in the '/custom-font-code/custom-fonts-uploads.php' file. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible via a forged request granted they can trick a site administrator into performing an action such as clicking on a link.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":729,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64767 - hpke-js reuses AEAD nonces","url":"https://cvefeed.io/vuln/detail/CVE-2025-64767","date":1763752563,"author":"","guid":6106,"unread":true,"content":"<article>CVE-2025-64767\n Nov. 21, 2025, 7:16 p.m. | 6&nbsp;hours, 22&nbsp;minutes ago\nhpke-js is a Hybrid Public Key Encryption (HPKE) module built on top of Web Cryptography API. Prior to version 1.7.5, the public SenderContext Seal() API has a race condition which allows for the same AEAD nonce to be re-used for multiple Seal() calls. This can lead to complete loss of Confidentiality and Integrity of the produced messages. This issue has been patched in version 1.7.5.\n 9.1 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":571,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-41115 - Incorrect privilege assignment","url":"https://cvefeed.io/vuln/detail/CVE-2025-41115","date":1763738152,"author":"","guid":6077,"unread":true,"content":"<article>CVE-2025-41115\n Nov. 21, 2025, 3:15 p.m. | 10&nbsp;hours, 22&nbsp;minutes ago\nSCIM provisioning was&nbsp;introduced&nbsp;in Grafana Enterprise and Grafana Cloud in April to improve how organizations manage users and teams in Grafana by introducing automated user lifecycle management.\n\nIn Grafana versions 12.x where SCIM provisioning is enabled and configured, a vulnerability in user identity handling allows a malicious or compromised SCIM client to provision a user with a numeric externalId, which in turn could allow to override internal user IDs and lead to impersonation or privilege escalation.\n\nThis vulnerability applies only if&nbsp;all&nbsp;of the following conditions are met:\n- `enableSCIM`&nbsp;feature flag set to true\n- `user_sync_enabled`&nbsp;config option in the&nbsp;`[auth.scim]`&nbsp;block set to true\n 10.0 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":900,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-11127 - Mstoreapp Mobile (App <= 2.08, Multivendor <= 9.0.1) - Unauthenticated Privilege Escalation","url":"https://cvefeed.io/vuln/detail/CVE-2025-11127","date":1763734559,"author":"","guid":6076,"unread":true,"content":"<article>CVE-2025-11127\n Nov. 21, 2025, 2:15 p.m. | 11&nbsp;hours, 22&nbsp;minutes ago\nThe Mstoreapp Mobile App WordPress plugin through 2.08 and Mstoreapp Mobile Multivendor through 9.0.1 do not properly verify users identify when using an AJAX action, allowing unauthenticated users to retrieve a valid session for arbitrary users by knowing their email address.\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":461,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-13156 - Vitepos – Point of Sale (POS) for WooCommerce <= 3.3.0 - Authenticated (Subscriber+) Arbitrary File Upload to Remote Code Execution","url":"https://cvefeed.io/vuln/detail/CVE-2025-13156","date":1763716546,"author":"","guid":6032,"unread":true,"content":"<article>CVE-2025-13156\n Nov. 21, 2025, 9:15 a.m. | 16&nbsp;hours, 22&nbsp;minutes ago\nThe Vitepos – Point of Sale (POS) for WooCommerce plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the insert_media_attachment() function in all versions up to, and including, 3.3.0. This is due to the save_update_category_img() function accepting user-supplied file types without validation when processing category images. This makes it possible for authenticated attackers, with subscriber level access and above, to upload arbitrary files on the affected site's server which makes remote code execution possible.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":749,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-13322 - WP AUDIO GALLERY <= 2.0 - Authenticated (Subscriber+) Arbitrary File Deletion via 'audio_upload' Parameter","url":"https://cvefeed.io/vuln/detail/CVE-2025-13322","date":1763712955,"author":"","guid":6031,"unread":true,"content":"<article>CVE-2025-13322\n Nov. 21, 2025, 8:15 a.m. | 17&nbsp;hours, 22&nbsp;minutes ago\nThe WP AUDIO GALLERY plugin for WordPress is vulnerable to arbitrary file deletion due to insufficient file path validation in all versions up to, and including, 2.0. This is due to the `wpag_uploadaudio_callback()` AJAX handler not properly validating user-supplied file paths in the `audio_upload` parameter before passing them to `unlink()`. This makes it possible for authenticated attackers, with subscriber-level access and above, to delete arbitrary files on the server, which can easily lead to remote code execution when critical files like wp-config.php are deleted.\n 8.1 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":756,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-11985 - Realty Portal <= 0.4.1 - Missing Authorization to Authenticated (Subscriber+) Arbitrary Options Update","url":"https://cvefeed.io/vuln/detail/CVE-2025-11985","date":1763712952,"author":"","guid":6029,"unread":true,"content":"<article>CVE-2025-11985\n Nov. 21, 2025, 8:15 a.m. | 17&nbsp;hours, 22&nbsp;minutes ago\nThe Realty Portal plugin for WordPress is vulnerable to unauthorized modification of data that can lead to privilege escalation due to a missing capability check on the 'rp_save_property_settings' function in versions 0.1 to 0.4.1. This makes it possible for authenticated attackers, with Subscriber-level access and above, to update arbitrary options on the WordPress site. This can be leveraged to update the default role for registration to administrator and enable user registration for attackers to gain administrative user access to a vulnerable site.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":737,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-12138 - URL Image Importer <= 1.0.6 - Authenticated (Author+) Arbitrary File Upload","url":"https://cvefeed.io/vuln/detail/CVE-2025-12138","date":1763712952,"author":"","guid":6030,"unread":true,"content":"<article>CVE-2025-12138\n Nov. 21, 2025, 8:15 a.m. | 17&nbsp;hours, 22&nbsp;minutes ago\nThe URL Image Importer plugin for WordPress is vulnerable to arbitrary file uploads due to insufficient file type validation in all versions up to, and including, 1.0.6. This is due to the plugin relying on a user-controlled Content-Type HTTP header to validate file uploads in the 'uimptr_import_image_from_url()' function which writes the file to the server before performing proper validation. This makes it possible for authenticated attackers, with Author-level access and above, to upload arbitrary files on the affected site's server which may make remote code execution possible via the uploaded PHP file.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":793,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-11456 - ELEX WordPress HelpDesk & Customer Ticketing System <= 3.3.1 - Unauthenticated Arbitrary File Upload","url":"https://cvefeed.io/vuln/detail/CVE-2025-11456","date":1763712948,"author":"","guid":6028,"unread":true,"content":"<article>CVE-2025-11456\n Nov. 21, 2025, 8:15 a.m. | 17&nbsp;hours, 22&nbsp;minutes ago\nThe ELEX WordPress HelpDesk &amp; Customer Ticketing System plugin for WordPress is vulnerable to arbitrary file uploads due to missing file type validation in the eh_crm_new_ticket_post() function in all versions up to, and including, 3.3.1. This makes it possible for unauthenticated attackers to upload arbitrary files on the affected site's server which may make remote code execution possible.\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":578,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How And Why We Hacked Cypherock Hardware Wallet: The Full Story","url":"https://www.darknavy.org/blog/how_and_why_we_hacked_cypherock_hardware_wallet_the_full_story/","date":1763711254,"author":"DARKNAVY","guid":6026,"unread":true,"content":"<article>On blockchains, whoever controls the private key to an address controls the funds in the corresponding account.\n\nIn October 2025, the U.S. government announced the seizure of **127,000 BTC** from Prince Group. On‑chain tracing reports indicated that these funds were in fact the assets stolen from the _LuBian_ mining pool in December 2020.\n\nA Bitcoin private key is a 256‑bit random number and is, in theory, infeasible to brute‑force. How did the U.S. government obtain _LuBian_’s wallet private key?\n\nIn 2023, the Milk Sad research team discovered and disclosed a pseudo‑random number vulnerability in **Libbitcoin Explorer (bx)**: bx used only a **32‑bit** random number as a seed, and from this seed deterministically generated a 256‑bit “random” number. Such insecure randomness can be brute‑forced within hours, and LuBian’s wallet key generation suffered from the same issue.\n\nThe security threats to private keys do not end there. Beyond algorithmic flaws in software wallets themselves, the devices storing private keys are often online: system vulnerabilities, malicious plugins, phishing sites, remote‑control trojans, and other attack vectors can steal keys or signing authority without the user noticing.\n\nTo better protect private keys, hardware wallets emerged. By isolating private keys within a dedicated chip on an offline device, preventing direct exposure to the network, they are regarded as the “safe box” of digital assets.\n\nBut are hardware wallets truly absolutely secure?\n\nIn the March article _If the Person Who Finds a Web3 Hardware Wallet is a Hacker_, DARKNAVY already demonstrated an attack displaying “Hacked” on a Cypherock hardware wallet. However, merely displaying this text does not cause any real harm. Therefore, on stage at **GEEKCON 2025**, DARKNAVY showcased real‑world attacks on two hardware wallets. For Cypherock, we simulated a supply‑chain attack, tampering with the firmware, bypassing secure boot and device authenticity verification, and ultimately gaining control over newly generated mnemonic phrases.\n\nThis article outlines how DARKNAVY discovered multiple vulnerabilities and weaknesses in Cypherock and chained them together for exploitation.\n\n## The Unique Architecture\n\nThe PIN code and mnemonic are the two most critical pieces of information in a hardware wallet; leakage of either may result in stolen funds. Therefore, many hardware wallets utilise a Secure Element _(SE)_ to protect these secrets. Although the Cypherock X1 Vault has an ATECC608A secure element built in, this SE is **only used for device authenticity checks**.\n\nIn X1’s unique architecture, the mnemonic is split into 5 shares using **Shamir’s Secret Sharing** algorithm and stored across the wallet itself _(X1 Vault)_ and 4 NFC cards. When a signature is needed, the private key can be reconstructed in the Vault using the Vault and any one of the NFC cards. PIN verification is also performed by the NFC cards.\n\nAll of the exploitation chain described here takes place on the X1 Vault MCU, and does not involve the SE or the cards.\n\n## **Control Flow Hijacking**\n\nWhether via manual auditing or LLM‑based automated bug hunting, one can find numerous vulnerabilities in the open‑source firmware repository of the X1 Vault. For example, when the wallet selects an applet based on the `applet_id` in a USB packet, there is an out‑of‑bounds access which makes a function pointer controllable.\n\n```\nconst cy_app_desc_t *registry_get_app_desc(uint32_t app_id) { return descriptors[app_id]; // OOB } void main_menu_host_interface(engine_ctx_t *ctx, usb_event_t usb_evt, const void *data) { uint32_t applet_id = get_applet_id(); const cy_app_desc_t *desc = registry_get_app_desc(applet_id); if (NULL != desc) { desc-&gt;app(usb_evt, desc-&gt;app_config); // ...... }\n```\n\nFixed firmware loading addresses, disabled **Canary**, and the absence of **Execute‑Never** protection allow any vulnerability to be easily converted into **ROP** or **shellcode execution**.\n\n## The Truth About Being “Open‑source”\n\nTo research further exploitation methods, we turned to the logic of firmware upgrade and boot verification.\n\nAlthough Cypherock claims to be “fully open source”, only the **“Application Firmware”** is open source. The **Bootloader** and the **Firewall Code Area**, mentioned in the documentation, are not open source. They are designed to be non-upgradeable, so we cannot extract them from firmware update packages either. Crucially, the firmware verification logic resides within these two sections.\n\nWith a simple attempt we discovered that after hijacking the control flow, the **Bootloader code segment** can be directly read and sent to the computer via USB. However the **Firewall Code** _(and Firewall Data Storage)_ cannot be read. By reverse‑engineering the Firewall initialisation logic within the Bootloader, we confirmed that the unreadable memory segment is indeed protected.\n\n&gt; Firewall is a hardware security feature provided by the STM32L4 series, implementing memory access isolation.\n&gt;\n&gt; STM32L4 allows the user to define one protected region each for Code, Non‑Volatile Data, and Volatile Data; only instructions in the Firewall Code region may access the protected areas.\n&gt;\n&gt; In addition, Firewall Code can only be called via a Call Gate; directly jumping into an address inside the protected region is treated as an illegal access.\n\nAs only the Firewall Code can read itself, we turned our attention to analysing the Firewall’s functionality in order to discover vulnerabilities.\n\n## Tearing Through The Firewall Protection\n\nThe Firewall Call Gate entry is implemented as a function; the parameter `task` distinguishes functionality, along with two address pointers and their size.\n\n```\nstatic uint32_t firewall_func(const uint32_t task, const uint8_t *data, const uint32_t size, const uint32_t address)\n```\n\nThe Application Firmware mostly uses the Firewall to read and write the Firewall‑protected **NVDATA** region. This region contains 4 pages:\n\n1. Primary Bootloader Data: stores firmware version, firmware hash, device state, etc.\n2. Backup Bootloader Data: backup of the above information\n3. Permanent Key Storage: stores various device keys\n4. Secure Data Storage: stores wallet information, etc.\n\nFor the first two pages, the Firewall exposes only limited, restricted read/write interfaces. For the last two pages, multiple tasks are provided for read/write, analogous to `**memcpy**`: the `address` parameter points into the protected region, while `data` points to external data. The Firewall code should have validated the ranges of both pointers and the read/write length, but testing showed that the **WRITE** functionality allows `data` to be any address. By setting `**data**` to point to the Firewall Code, we can copy ( **WRITE**) the protected code into **NVDATA**, and then **READ** the **NVDATA** out.\n\nThere is one last small obstacle: **WRITE** is not a simple memory copy but a Flash write. Before repeatedly writing to the same address, the entire page must first be erased. To avoid corrupting valid NVDATA and bricking the device, we located a function that erases **Secure Data Storage** and then rewrites the latest full data. At this point, the remaining free space in this page can be safely used to dump Firewall Code.\n\n## Fragmented Upgrade Logic\n\nHaving obtained full codes within the MCU, we can now truly analyse the firmware verification logic. Skipping the reverse‑engineering process, here is a summary of the firmware ( _Application Firmware_) upgrade flow:\n\n1. The Application Firmware sets\n    `BOOTSTATE` to “upgrading” via the Firewall and then reboots the device.\n2. The Bootloader enters the upgrade process, receives the firmware header from USB, then calls multiple Firewall tasks to:\n\n   a. Set\n    `BOOTSTATE` to “in upgrade”.\n   b. Verify the signature on the firmware header, then store the firmware version and size in Bootloader RAM.\n\n   c. Store the firmware’s signature in Bootloader RAM.\n\n3. The Bootloader receives the full firmware from USB page by page, erasing and writing the corresponding Flash regions.\n\n4. The Bootloader again calls multiple Firewall tasks to:\n\n   d. Hashing the current (newly-written) firmware, and verify it against the signature saved in step 1c.\n\n   e. Hashing the current firmware again, and together with the firmware version and size saved in step 1b, write them into\n    **Primary Bootloader Data**, and restore `BOOTSTATE` to the normal state.\n\nIf at any point the USB connection is interrupted or any verification fails, the device reboots immediately and re‑enters the upgrade process.\n\nNote that the upgrade flow has serious flaws: each Firewall task is independent and **can be executed out of order** (in particular, the two signature verifications in **1b** and **1c**); the firmware signature is never written to Flash, and on boot **only integrity is checked, not authenticity**.\n\nThus, after hijacking MCU control flow, we can directly erase and rewrite the firmware code and then call the Firewall task from **3e** to calculate and store the current (malicious) firmware hash, achieving firmware tampering. As for the parameters saved after verification in step **1b** that **3e** relies on, we can simply modify them—attentive readers may have noticed that the Bootloader and Firewall Code share the same RAM, and the Firewall initialization code does not set any protection for the Volatile Data region.\n\n## **Illusory Authenticity Verification**\n\nAt GEEKCON, we simulated what an ordinary user might do when first receiving a newly purchased Cypherock wallet for “inspection”: the judge connected the **wallet already compromised by the contestant** to a computer and used Cypherock’s CySync software to perform a device authenticity check. Seconds later, this backdoored wallet passed the vendor’s check, with “verification passed” shown both on the computer and on the wallet screen.\n\nAccording to the vendor’s design, the first boot after flashing the wallet firmware should trigger a mandatory device authenticity check, and tampered firmware should not be able to pass this check. So how did we achieve the last step in the supply‑chain attack?\n\nCypherock’s authenticity verification process is shown in the diagram; the Vault’s SE finally comes into play: it uses a built‑in private key to sign twice—first over the device serial number, then over the XOR of a cloud‑generated nonce and the firmware hash. Once the cloud returns the verification result, the device saves the status.\n\nSince the second signature incorporates the firmware hash, and the client PC also submits the device’s firmware version, the cloud can determine whether the firmware hash is correct. However, the SE cannot directly read the firmware; what authenticity is there in a hash provided by malicious firmware?\n\nIn addition, this check is only **unidirectional**: the cloud verifies the device, but the device does not verify the cloud. If the goal is merely to bypass the device‑side check, the client can simply return “success” locally.\n\n## The Vendor’s Attitude\n\nAlthough Cypherock loudly boasts itself as the “Safest Hardware Wallet” and offers a public bug bounty program on its website, its attitude toward both users and security researchers can be summarised as **silence is golden**.\n\nIn March, DARKNAVY reported two vulnerabilities to Cypherock by email. They silently pushed patches to GitHub but did not even bother to send an acknowledgment. Coincidentally, at this year’s Hexacon, the session titled “ **Breaking the Vault: USB Bugs and Bug Bounty Failures**” explicitly highlighted the experiences of peers reporting vulnerabilities to Cypherock.\n\nVulnerability fixes also lack transparency, leaving users entirely in the dark about the security state of their devices; when people ask about sessions on conferences, the vendor brushes them off with a perfunctory “already resolved long ago”.\n\nTherefore, for the Bootloader and Firewall vulnerabilities involved this time, we chained them to flash a custom firmware, replacing the boot logo and mnemonic display, just for amusement.</article>","contentLength":12269,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64695 - LogStare Collector Windows Installer Uncontrolled Search Path Element Vulnerability (RCE)","url":"https://cvefeed.io/vuln/detail/CVE-2025-64695","date":1763705885,"author":"","guid":6018,"unread":true,"content":"<article>CVE-2025-64695\n Nov. 21, 2025, 7:15 a.m. | 18&nbsp;hours, 22&nbsp;minutes ago\nUncontrolled search path element issue exists in the installer of LogStare Collector (for Windows). If exploited, arbitrary code may be executed with the privilege of the user invoking the installer.\n 8.4 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":379,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64310 - Epson Projector WebConfig Brute Force Authentication Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-64310","date":1763694970,"author":"","guid":6007,"unread":true,"content":"<article>CVE-2025-64310\n Nov. 21, 2025, 3:16 a.m. | 22&nbsp;hours, 22&nbsp;minutes ago\nEPSON WebConfig and Epson Web Control for SEIKO EPSON Projector Products do not restrict excessive authentication attempts. An administrative user's password may be identified through a brute force attack.\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":389,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64762 - authkit-nextjs may let session cookies be cached in CDNs","url":"https://cvefeed.io/vuln/detail/CVE-2025-64762","date":1763691344,"author":"","guid":5997,"unread":true,"content":"<article>CVE-2025-64762\n Nov. 21, 2025, 2:15 a.m. | 23&nbsp;hours, 22&nbsp;minutes ago\nThe AuthKit library for Next.js provides convenient helpers for authentication and session management using WorkOS &amp; AuthKit with Next.js. In authkit-nextjs version 2.11.0 and below, authenticated responses do not defensively apply anti-caching headers. In environments where CDN caching is enabled, this can result in session tokens being included in cached responses and subsequently served to multiple users. Next.js applications deployed on Vercel are unaffected unless they manually enable CDN caching by setting cache headers on authenticated paths. Patched in authkit-nextjs 2.11.1, which applies anti-caching headers to all responses behind authentication.\n 8.0 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":844,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-62164 - VLLM deserialization vulnerability leading to DoS and potential RCE","url":"https://cvefeed.io/vuln/detail/CVE-2025-62164","date":1763691343,"author":"","guid":5994,"unread":true,"content":"<article>CVE-2025-62164\n Nov. 21, 2025, 2:15 a.m. | 23&nbsp;hours, 22&nbsp;minutes ago\nvLLM is an inference and serving engine for large language models (LLMs). From versions 0.10.2 to before 0.11.1, a memory corruption vulnerability could lead to a crash (denial-of-service) and potentially remote code execution (RCE), exists in the Completions API endpoint. When processing user-supplied prompt embeddings, the endpoint loads serialized tensors using torch.load() without sufficient validation. Due to a change introduced in PyTorch 2.8.0, sparse tensor integrity checks are disabled by default. As a result, maliciously crafted tensors can bypass internal bounds checks and trigger an out-of-bounds memory write during the call to to_dense(). This memory corruption can crash vLLM and potentially lead to code execution on the server hosting vLLM. This issue has been patched in version 0.11.1.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":991,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-62372 - vLLM vulnerable to DoS with incorrect shape of multimodal embedding inputs","url":"https://cvefeed.io/vuln/detail/CVE-2025-62372","date":1763691343,"author":"","guid":5995,"unread":true,"content":"<article>CVE-2025-62372\n Nov. 21, 2025, 2:15 a.m. | 23&nbsp;hours, 22&nbsp;minutes ago\nvLLM is an inference and serving engine for large language models (LLMs). From version 0.5.5 to before 0.11.1, users can crash the vLLM engine serving multimodal models by passing multimodal embedding inputs with correct ndim but incorrect shape (e.g. hidden dimension is wrong), regardless of whether the model is intended to support such inputs (as defined in the Supported Models page). This issue has been patched in version 0.11.1.\n 8.3 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":616,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64755 - @anthropic-ai/claude-code has Sed Command Validation Bypass that Allows Arbitrary File Writes","url":"https://cvefeed.io/vuln/detail/CVE-2025-64755","date":1763691343,"author":"","guid":5996,"unread":true,"content":"<article>CVE-2025-64755\n Nov. 21, 2025, 2:15 a.m. | 23&nbsp;hours, 22&nbsp;minutes ago\nClaude Code is an agentic coding tool. Prior to version 2.0.31, due to an error in sed command parsing, it was possible to bypass the Claude Code read-only validation and write to arbitrary files on the host system. This issue has been patched in version 2.0.31.\n 8.7 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":442,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-62459 - Microsoft Defender Portal Spoofing Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-62459","date":1763677137,"author":"","guid":5991,"unread":true,"content":"<article>CVE-2025-62459\n Nov. 20, 2025, 11:15 p.m. | 1&nbsp;day, 2&nbsp;hours ago\nMicrosoft Defender Portal Spoofing Vulnerability\n 8.3 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":223,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-62207 - Azure Monitor Elevation of Privilege Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-62207","date":1763677118,"author":"","guid":5990,"unread":true,"content":"<article>CVE-2025-62207\n Nov. 20, 2025, 11:15 p.m. | 1&nbsp;day, 2&nbsp;hours ago\nAzure Monitor Elevation of Privilege Vulnerability\n 8.6 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":225,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-49752 - Azure Bastion Elevation of Privilege Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-49752","date":1763677117,"author":"","guid":5989,"unread":true,"content":"<article>CVE-2025-49752\n Nov. 20, 2025, 11:15 p.m. | 22&nbsp;hours, 15&nbsp;minutes ago\nAzure Bastion Elevation of Privilege Vulnerability\n 10.0 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":236,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64655 - Dynamics OmniChannel SDK Storage Containers Elevation of Privilege Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-64655","date":1763677116,"author":"","guid":5987,"unread":true,"content":"<article>CVE-2025-64655\n Nov. 20, 2025, 11:15 p.m. | 1&nbsp;day, 2&nbsp;hours ago\nImproper authorization in Dynamics OmniChannel SDK Storage Containers allows an unauthorized attacker to elevate privileges over a network.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":314,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-59245 - Microsoft SharePoint Online Elevation of Privilege Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-59245","date":1763677116,"author":"","guid":5988,"unread":true,"content":"<article>CVE-2025-59245\n Nov. 20, 2025, 11:15 p.m. | 1&nbsp;day, 2&nbsp;hours ago\nMicrosoft SharePoint Online Elevation of Privilege Vulnerability\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":243,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-36072 - IBM webMethods Integration Deserialization","url":"https://cvefeed.io/vuln/detail/CVE-2025-36072","date":1763676582,"author":"","guid":5986,"unread":true,"content":"<article>CVE-2025-36072\n Nov. 20, 2025, 11:15 p.m. | 22&nbsp;hours, 15&nbsp;minutes ago\nIBM webMethods Integration 10.11 through 10.11_Core_Fix22, 10.15 through 10.15_Core_Fix22, and 11.1 through 11.1_Core_Fix6 IBM webMethods Integration allow an authenticated user to execute arbitrary code on the system, caused by the deserialization of untrusted object graphs data.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":462,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-63685 - Quark Cloud Drive DLL Hijacking","url":"https://cvefeed.io/vuln/detail/CVE-2025-63685","date":1763673366,"author":"","guid":6074,"unread":true,"content":"<article>CVE-2025-63685\n Nov. 20, 2025, 9:16 p.m. | 1&nbsp;day ago\nQuark Cloud Drive v3.23.2 has a DLL Hijacking vulnerability. This vulnerability stems from the insecure loading of system libraries. Specifically, the application does not validate the path or signature of [regsvr32.exe] it loads. An attacker can place a crafted malicious DLL in the application's startup directory, which will be loaded and executed when the user launches the program.\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":554,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-63807 - \"Blogin Weak Verification Code Brute-Force Authentication Bypass\"","url":"https://cvefeed.io/vuln/detail/CVE-2025-63807","date":1763673366,"author":"","guid":6075,"unread":true,"content":"<article>CVE-2025-63807\n Nov. 20, 2025, 9:16 p.m. | 1&nbsp;day ago\nAn issue was discovered in weijiang1994 university-bbs (aka Blogin) in commit 9e06bab430bfc729f27b4284ba7570db3b11ce84 (2025-01-13). A weak verification code generation mechanism combined with missing rate limiting allows attackers to perform brute-force attacks on verification codes without authentication. Successful exploitation may result in account takeover via password reset or other authentication bypass methods.\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":590,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-48986 - Revive Adserver Authorization Bypass Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-48986","date":1763669782,"author":"","guid":5978,"unread":true,"content":"<article>CVE-2025-48986\n Nov. 20, 2025, 8:16 p.m. | 1&nbsp;day, 1&nbsp;hour ago\nAuthorization bypass in Revive Adserver 5.5.2 and 6.0.1 and earlier versions causes an logged in attacker to change other users' email address and potentialy take over their accounts using the forgot password functionality.\n 8.8 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":396,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-52668 - Revive Adserver Stored XSS","url":"https://cvefeed.io/vuln/detail/CVE-2025-52668","date":1763669782,"author":"","guid":5979,"unread":true,"content":"<article>CVE-2025-52668\n Nov. 20, 2025, 8:16 p.m. | 1&nbsp;day, 1&nbsp;hour ago\nImproper input neutralization in the stats-conversions.php script in Revive Adserver 5.5.2 and 6.0.1 and earlier versions causes potential information disclosure and session hijacking via a stored XSS attack.\n 8.7 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":381,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-63888 - ThinkPHP File Template Driver Remote Code Execution Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-63888","date":1763662550,"author":"","guid":6073,"unread":true,"content":"<article>CVE-2025-63888\n Nov. 20, 2025, 6:15 p.m. | 21&nbsp;hours, 15&nbsp;minutes ago\nThe read function in file thinkphp\\library\\think\\template\\driver\\File.php in ThinkPHP 5.0.24 contains a remote code execution vulnerability.\n 9.8 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":324,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-10571 - ABB Ability Edgenius Authentication Bypass","url":"https://cvefeed.io/vuln/detail/CVE-2025-10571","date":1763661960,"author":"","guid":5972,"unread":true,"content":"<article>CVE-2025-10571\n Nov. 20, 2025, 7:16 p.m. | 1&nbsp;day ago\nAuthentication Bypass Using an Alternate Path or Channel vulnerability in ABB ABB Ability Edgenius.This issue affects ABB Ability Edgenius: 3.2.0.0, 3.2.1.1.\n 9.6 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":325,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-64428 - DataEase DB2 JNDI Vulnerability","url":"https://cvefeed.io/vuln/detail/CVE-2025-64428","date":1763658953,"author":"","guid":5967,"unread":true,"content":"<article>CVE-2025-64428\n Nov. 20, 2025, 5:15 p.m. | 16&nbsp;hours, 15&nbsp;minutes ago\nDataease is an open source data visualization analysis tool. Versions prior to 2.10.17 are vulnerable to JNDI injection. A blacklist was added in the patch for version 2.10.14. However, JNDI injection remains possible via the iiop, corbaname, and iiopname schemes. The vulnerability has been fixed in version 2.10.17.\n 8.9 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":497,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-62730 - Privilege Escalation via Incorrect Authorization in SOPlanning","url":"https://cvefeed.io/vuln/detail/CVE-2025-62730","date":1763655360,"author":"","guid":5957,"unread":true,"content":"<article>CVE-2025-62730\n Nov. 20, 2025, 4:16 p.m. | 17&nbsp;hours, 15&nbsp;minutes ago\nSOPlanning is vulnerable to Privilege Escalation in user management tab. Users with user_manage_team role are allowed to modify permissions of users. However, they are able to assign administrative permissions to any user including themselves. This allow a malicious authenticated attacker with this role to escalate to admin privileges. This issue affects both Bulk Update functionality and regular edition of user's right and privileges.\n\nThis issue was fixed in version 1.55.\n 8.7 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":658,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-62294 - Predictable Generation of Password Recovery Token","url":"https://cvefeed.io/vuln/detail/CVE-2025-62294","date":1763655359,"author":"","guid":5956,"unread":true,"content":"<article>CVE-2025-62294\n Nov. 20, 2025, 4:15 p.m. | 17&nbsp;hours, 15&nbsp;minutes ago\nSOPlanning is vulnerable to Predictable Generation of Password Recovery Token. Due to weak mechanism of generating recovery tokens, a malicious attacker is able to brute-force all possible values and takeover any account in reasonable amount of time.\n\nThis issue was fixed in version 1.55.\n 8.7 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":469,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-34320 - BASIS BBj < 25.00 Unauthenticated Arbitrary File Read RCE","url":"https://cvefeed.io/vuln/detail/CVE-2025-34320","date":1763655357,"author":"","guid":5955,"unread":true,"content":"<article>CVE-2025-34320\n Nov. 20, 2025, 4:15 p.m. | 17&nbsp;hours, 15&nbsp;minutes ago\nBASIS BBj versions prior to 25.00 contain a Jetty-served web endpoint that fails to properly validate or canonicalize input path segments. This allows unauthenticated directory traversal sequences to cause the server to read arbitrary system files accessible to the account running the service. Retrieved configuration artifacts may contain account credentials used for BBj Enterprise Manager; possession of these credentials enables administrative access and use of legitimate management functionality that can result in execution of system commands under the service account. Depending on the operating system and the privileges of the BBj service account, this issue may also allow access to other sensitive files on the host, including operating system or application data, potentially exposing additional confidential information.\n 9.3 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":1019,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-13445 - Tenda AC21 SetIpMacBind stack-based overflow","url":"https://cvefeed.io/vuln/detail/CVE-2025-13445","date":1763651845,"author":"","guid":5930,"unread":true,"content":"<article>CVE-2025-13445\n Nov. 20, 2025, 3:17 p.m. | 16&nbsp;hours, 35&nbsp;minutes ago\nA flaw has been found in Tenda AC21 16.03.08.16. This affects an unknown part of the file /goform/SetIpMacBind. Executing manipulation of the argument list can lead to stack-based buffer overflow. The attack can be executed remotely. The exploit has been published and may be used.\n 9.0 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":461,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-13446 - Tenda AC21 SetSysTimeCfg stack-based overflow","url":"https://cvefeed.io/vuln/detail/CVE-2025-13446","date":1763651845,"author":"","guid":5931,"unread":true,"content":"<article>CVE-2025-13446\n Nov. 20, 2025, 3:17 p.m. | 18&nbsp;hours, 13&nbsp;minutes ago\nA vulnerability has been found in Tenda AC21 16.03.08.16. This vulnerability affects unknown code of the file /goform/SetSysTimeCfg. The manipulation of the argument timeZone/time leads to stack-based buffer overflow. The attack is possible to be carried out remotely. The exploit has been disclosed to the public and may be used.\n 9.0 | HIGH\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":510,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CVE-2025-12414 - Looker account compromise via punycode homograph attack","url":"https://cvefeed.io/vuln/detail/CVE-2025-12414","date":1763634772,"author":"","guid":5908,"unread":true,"content":"<article>CVE-2025-12414\n Nov. 20, 2025, 3:17 p.m. | 16&nbsp;hours, 35&nbsp;minutes ago\nAn attacker could take over a Looker account in a Looker instance configured with OIDC authentication, due to email address string normalization.Looker-hosted and Self-hosted were found to be vulnerable.\n\nThis issue has already been mitigated for Looker-hosted.\n\n\nSelf-hosted instances must be upgraded as soon as possible. This vulnerability has been patched in all supported versions of Self-hosted.\nThe versions below have all been updated to protect from this vulnerability. You can download these versions at the Looker download page   https://download.looker.com/ :\n  *  24.12.100+\n  *  24.18.193+\n  *  25.0.69+\n  *  25.6.57+\n  *  25.8.39+\n  *  25.10.22+\n  *  25.12.0+\n 9.2 | CRITICAL\n\nVisit the link for more details, such as CVSS details, affected products, timeline, and more...\n</article>","contentLength":858,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"RBAC Privilege Escalation via Opto22 Groov View API","url":"https://github.com/metaredteam/external-disclosures/security/advisories/GHSA-wvxp-wpwp-mmpw","date":1763596828,"author":"ismai1337","guid":5983,"unread":true,"content":"<article>/\n\n **external-disclosures** Public\n\n# RBAC Privilege Escalation via Opto22 Groov View API\n\n## Package\n\nOpto22 Groov EPICS\n\n## Affected versions\n\nAll versions prior to 4.0.3\n\n## Patched versions\n\n4.0.3\n\n## Description\n\n### Impact\n\nThe View Users API endpoint returns a list of all users and associated metadata- including the web API tokens. This endpoint requires an Editor role to access and will display API keys for all users, including system-wide admins.\n\n### Vulnerability Description\n\nA RBAC privilege escalation issue was found allowing a malicious user with the Editor role to escalate to admin level access by leaking targeted web API tokens.\n\n### Identification and Remediation\n\nThis issue was identified during a Red Team X assessment and is disclosed in ​​CVE-2025-13084. This issue has since been resolved and a fix has been made available for customers.</article>","contentLength":873,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Remote Code Execution via Opto22 Groov Manage REST API","url":"https://github.com/metaredteam/external-disclosures/security/advisories/GHSA-jq6g-ccmp-vccr","date":1763596828,"author":"ismai1337","guid":5984,"unread":true,"content":"<article>**external-disclosures** Public\n\n# Remote Code Execution via Opto22 Groov Manage REST API\n\n## Package\n\n## Affected versions\n\n## Patched versions\n\n## Description\n\n### Impact\n\nThe Opto22 Groov Manage maintenance application endpoint is vulnerable to remote code execution. This means an attacker can create a specially crafted request that when executed will achieve remote code execution in the context of the Opto Edge web application which is running as root.\n\n### Vulnerability Description\n\nWhen a POST request is executed against the /manage/api/v1/maintenance/update/apply endpoint, the application reads the uploader-file-id header from the request and unsafely uses this value to build a command to delete a file- allowing an attacker to inject arbitrary commands which execute as root.\n\n### Identification and Remediation\n\nThis issue was identified during a Red Team X assessment and is disclosed in ​CVE-2025-13087. This issue has since been resolved and a fix has been made available for customers.</article>","contentLength":1009,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["vulns"]}